/*
#############################################################################################
# Outlast (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: GameFramework_classes.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_LOADING_MOVIE                                     "
#define CONST_GAMEEVENT_AGGREGATED_DATA                         1
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_TIMEALIVE             1
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_KILLS                 1
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_DEATHS                1
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_MATCH_WON             1
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_ROUND_WON             1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_DEALT_NORMALKILL      1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_RECEIVED_WASNORMALKILL 1
#define CONST_GAMEEVENT_AGGREGATED_TEAM_KILLS                   1
#define CONST_GAMEEVENT_AGGREGATED_TEAM_DEATHS                  1
#define CONST_GAMEEVENT_AGGREGATED_TEAM_GAME_SCORE              1
#define CONST_GAMEEVENT_AGGREGATED_TEAM_MATCH_WON               1
#define CONST_GAMEEVENT_AGGREGATED_TEAM_ROUND_WON               1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_KILLS                 1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_DEATHS                1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_DEALT_WEAPON_DAMAGE   1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_DEALT_MELEE_DAMAGE    1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_RECEIVED_WEAPON_DAMAGE 1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_RECEIVED_MELEE_DAMAGE 1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_DEALT_MELEEHITS       1
#define CONST_GAMEEVENT_AGGREGATED_DAMAGE_RECEIVED_WASMELEEHIT  1
#define CONST_GAMEEVENT_AGGREGATED_WEAPON_FIRED                 1
#define CONST_GAMEEVENT_AGGREGATED_PAWN_SPAWN                   1
#define CONST_GAMEEVENT_AGGREGATED_GAME_SPECIFIC                1
#define CONST_NumTouchDataEntries                               5
#define CONST_NumInDragHistory                                  4

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum GameFramework.GameTypes.EShakeParam
enum class EShakeParam : uint8_t
{
	ESP_OffsetRandom                                   = 0,
	ESP_OffsetZero                                     = 1,
	ESP_END                                            = 2
};

// Enum GameFramework.GameCrowdAgent.EConformType
enum class EConformType : uint8_t
{
	CFM_NavMesh                                        = 0,
	CFM_BSP                                            = 1,
	CFM_World                                          = 2,
	CFM_None                                           = 3,
	CFM_END                                            = 4
};

// Enum GameFramework.GameCrowdAgentBehavior.ECrowdBehaviorEvent
enum class ECrowdBehaviorEvent : uint8_t
{
	CBE_None                                           = 0,
	CBE_Spawn                                          = 1,
	CBE_Random                                         = 2,
	CBE_SeePlayer                                      = 3,
	CBE_EncounterAgent                                 = 4,
	CBE_TakeDamage                                     = 5,
	CBE_GroupWaiting                                   = 6,
	CBE_Uneasy                                         = 7,
	CBE_Alert                                          = 8,
	CBE_Panic                                          = 9,
	CBE_END                                            = 10
};

// Enum GameFramework.GameSkelCtrl_Recoil.ERecoilStart
enum class ERecoilStart : uint8_t
{
	ERS_Zero                                           = 0,
	ERS_Random                                         = 1,
	ERS_END                                            = 2
};

// Enum GameFramework.GameStateObject.GameSessionType
enum class EGameSessionType : uint8_t
{
	GT_SessionInvalid                                  = 0,
	GT_SinglePlayer                                    = 1,
	GT_Coop                                            = 2,
	GT_Multiplayer                                     = 3,
	GT_END                                             = 4
};

// Enum GameFramework.GameThirdPersonCameraMode.ECameraViewportTypes
enum class ECameraViewportTypes : uint8_t
{
	CVT_16to9_Full                                     = 0,
	CVT_16to9_VertSplit                                = 1,
	CVT_16to9_HorizSplit                               = 2,
	CVT_4to3_Full                                      = 3,
	CVT_4to3_HorizSplit                                = 4,
	CVT_4to3_VertSplit                                 = 5,
	CVT_END                                            = 6
};

// Enum GameFramework.MobileInputZone.EZoneType
enum class EZoneType : uint8_t
{
	ZoneType_Button                                    = 0,
	ZoneType_Joystick                                  = 1,
	ZoneType_Trackball                                 = 2,
	ZoneType_Slider                                    = 3,
	ZoneType_SubClassed                                = 4,
	ZoneType_END                                       = 5
};

// Enum GameFramework.MobileInputZone.EZoneState
enum class EZoneState : uint8_t
{
	ZoneState_Inactive                                 = 0,
	ZoneState_Activating                               = 1,
	ZoneState_Active                                   = 2,
	ZoneState_Deactivating                             = 3,
	ZoneState_END                                      = 4
};

// Enum GameFramework.MobileInputZone.EZoneSlideType
enum class EZoneSlideType : uint8_t
{
	ZoneSlide_UpDown                                   = 0,
	ZoneSlide_LeftRight                                = 1,
	ZoneSlide_END                                      = 2
};

// Enum GameFramework.MobilePlayerInput.EUIOrientation
enum class EUIOrientation : uint8_t
{
	UI_Unknown                                         = 0,
	UI_Portait                                         = 1,
	UI_PortaitUpsideDown                               = 2,
	UI_LandscapeRight                                  = 3,
	UI_LandscapeLeft                                   = 4,
	UI_END                                             = 5
};

// Enum GameFramework.MobileMenuImage.MenuImageDrawStyle
enum class EMenuImageDrawStyle : uint8_t
{
	IDS_Normal                                         = 0,
	IDS_Stretched                                      = 1,
	IDS_Tile                                           = 2,
	IDS_END                                            = 3
};

// Enum GameFramework.SeqEvent_HudRenderText.ETextDrawMethod
enum class ETextDrawMethod : uint8_t
{
	DRAW_CenterText                                    = 0,
	DRAW_WrapText                                      = 1,
	DRAW_END                                           = 2
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class GameFramework.DynamicSpriteComponent
// 0x004C OR 0x029C (0x029C - 0x0250)
// 76 OR 668 (668 - 592)
class UDynamicSpriteComponent : public USpriteComponent
{
public:
	struct FInterpCurveFloat                           AnimatedScale;                                 // 0x0250 (0x0014) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FInterpCurveLinearColor                     AnimatedColor;                                 // 0x0264 (0x0014) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FInterpCurveVector2D                        AnimatedPosition;                              // 0x0278 (0x0014) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FVector                                     LocationOffset;                                // 0x028C (0x000C) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            LoopCount;                                     // 0x0298 (0x0004) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.DynamicSpriteComponent");
		}

		return uClassPointer;
	};

};

// Class GameFramework.FrameworkGame
// 0x0010 OR 0x049C (0x049C - 0x048C)
// 16 OR 1180 (1180 - 1164)
class AFrameworkGame : public AGameInfo
{
public:
	TArray<struct FRequiredMobileInputConfig>          RequiredMobileInputConfigs;                    // 0x048C (0x0010) [0x0000000000404000] (CPF_Config | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.FrameworkGame");
		}

		return uClassPointer;
	};

};

// Class GameFramework.GameAIController
// 0x004C OR 0x049C (0x049C - 0x0450)
// 76 OR 1180 (1180 - 1104)
class AGameAIController : public AAIController
{
public:
	class UGameAICommand*                              CommandList;                                   // 0x0450 (0x0008) [0x0000000004002003] (CPF_Edit | CPF_Const | CPF_Transient | CPF_EditInline)
	uint32_t                                           bHasRunawayCommandList : 1;                    // 0x0458 (0x0004) [0x0000000000002000] [0x00000001] (CPF_Transient)
	uint32_t                                           bAILogging : 1;                                // 0x0458 (0x0004) [0x0000000000004001] [0x00000002] (CPF_Edit | CPF_Config)
	uint32_t                                           bAILogToWindow : 1;                            // 0x0458 (0x0004) [0x0000000000004001] [0x00000004] (CPF_Edit | CPF_Config)
	uint32_t                                           bFlushAILogEachLine : 1;                       // 0x0458 (0x0004) [0x0000000000004001] [0x00000008] (CPF_Edit | CPF_Config)
	uint32_t                                           bMapBasedLogName : 1;                          // 0x0458 (0x0004) [0x0000000000004001] [0x00000010] (CPF_Edit | CPF_Config)
	uint32_t                                           bAIDrawDebug : 1;                              // 0x0458 (0x0004) [0x0000000000004001] [0x00000020] (CPF_Edit | CPF_Config)
	uint32_t                                           bAIBroken : 1;                                 // 0x0458 (0x0004) [0x0000000000002000] [0x00000040] (CPF_Transient)
	class AFileLog*                                    AILogFile;                                     // 0x045C (0x0008) [0x0000000000002000] (CPF_Transient)
	float                                              DebugTextMaxLen;                               // 0x0464 (0x0004) [0x0000000000000001] (CPF_Edit)    
	TArray<struct FAICmdHistoryItem>                   CommandHistory;                                // 0x0468 (0x0010) [0x0000000000402003] (CPF_Edit | CPF_Const | CPF_Transient | CPF_NeedCtorLink)
	int32_t                                            CommandHistoryNum;                             // 0x0478 (0x0004) [0x0000000000004001] (CPF_Edit | CPF_Config)
	TArray<struct FName>                               AILogFilter;                                   // 0x047C (0x0010) [0x0000000000404001] (CPF_Edit | CPF_Config | CPF_NeedCtorLink)
	class FString                                      DemoActionString;                              // 0x048C (0x0010) [0x0000000000400020] (CPF_Net | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameAIController");
		}

		return uClassPointer;
	};

	class FString eventGetActionString();
	void SetDesiredRotation(struct FRotator TargetDesiredRotation, bool optionalInLockDesiredRotation, bool optionalInUnlockWhenReached, float optionalInterpolationTime);
	void eventAILog_Internal(class FString LogText, struct FName optionalLogCategory, bool optionalBForce);
	void RecordDemoAILog(class FString LogText);
	void eventDestroyed();
	void ReachedIntermediateMoveGoal();
	void ReachedMoveGoal();
	float GetDestinationOffset();
	class UGameAICommand* GetAICommandInStack(class UClass* InClass);
	class UGameAICommand* FindCommandOfClass(class UClass* SearchClass);
	void DumpCommandStack();
	void CheckCommandCount();
	class UGameAICommand* GetActiveCommand();
	bool AbortCommand(class UGameAICommand* AbortCmd, class UClass* optionalAbortClass);
	void PopCommand(class UGameAICommand* ToBePoppedCommand);
	void PushCommand(class UGameAICommand* NewCommand);
	void AllCommands(class UClass* BaseClass, class UGameAICommand*& Cmd);
};

// Class GameFramework.GameAICommand
// 0x0024 OR 0x0084 (0x0084 - 0x0060)
// 36 OR 132 (132 - 96)
class UGameAICommand : public UAICommandBase
{
public:
	class UGameAICommand*                              ChildCommand;                                  // 0x0060 (0x0008) [0x0000000004002003] (CPF_Edit | CPF_Const | CPF_Transient | CPF_EditInline)
	struct FName                                       ChildStatus;                                   // 0x0068 (0x0008) [0x0000000000002003] (CPF_Edit | CPF_Const | CPF_Transient)
	class AGameAIController*                           GameAIOwner;                                   // 0x0070 (0x0008) [0x0000000000002001] (CPF_Edit | CPF_Transient)
	struct FName                                       Status;                                        // 0x0078 (0x0008) [0x0000000000002001] (CPF_Edit | CPF_Transient)
	uint32_t                                           bAllowNewSameClassInstance : 1;                // 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bReplaceActiveSameClassInstance : 1;           // 0x0080 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bAborted : 1;                                  // 0x0080 (0x0004) [0x0000000000002000] [0x00000004] (CPF_Transient)
	uint32_t                                           bIgnoreNotifies : 1;                           // 0x0080 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bIgnoreStepAside : 1;                          // 0x0080 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bPendingPop : 1;                               // 0x0080 (0x0004) [0x0000000000002000] [0x00000020] (CPF_Transient)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameAICommand");
		}

		return uClassPointer;
	};

	bool HandlePathObstruction(class AActor* BlockedBy);
	bool MoveUnreachable(struct FVector AttemptedDest, class AActor* AttemptedTarget);
	void NotifyNeedRepath();
	class FString eventGetDebugVerboseText();
	void GetDebugOverheadText(class APlayerController* PC, TArray<class FString>& OutText);
	void eventDrawDebug(class AHUD* H, struct FName Category);
	class FString eventGetDumpString();
	void Resumed(struct FName OldCommandName);
	void Paused(class UGameAICommand* NewCommand);
	void Popped();
	void Pushed();
	void PostPopped();
	void PrePushed(class AGameAIController* AI);
	bool AllowStateTransitionTo(struct FName StateName);
	bool AllowTransitionTo(class UClass* AttemptCommand);
	void Tick(float DeltaTime);
	bool ShouldIgnoreNotifies();
	void eventInternalTick(float DeltaTime);
	void eventInternalResumed(struct FName OldCommandName);
	void eventInternalPaused(class UGameAICommand* NewCommand);
	void eventInternalPopped();
	void eventInternalPushed();
	void eventInternalPrePushed(class AGameAIController* AI);
	static bool InitCommand(class AGameAIController* AI);
	static bool InitCommandUserActor(class AGameAIController* AI, class AActor* UserActor);
};

// Class GameFramework.GameCameraBlockingVolume
// 0x0000 OR 0x0280 (0x0280 - 0x0280)
// 0 OR 640 (640 - 640)
class AGameCameraBlockingVolume : public ABlockingVolume
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCameraBlockingVolume");
		}

		return uClassPointer;
	};

};

// Class GameFramework.GamePlayerController
// 0x0010 OR 0x0748 (0x0748 - 0x0738)
// 16 OR 1864 (1864 - 1848)
class AGamePlayerController : public APlayerController
{
public:
	uint32_t                                           bWarnCrowdMembers : 1;                         // 0x0738 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bDebugCrowdAwareness : 1;                      // 0x0738 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bIsWarmupPaused : 1;                           // 0x0738 (0x0004) [0x0000000000002000] [0x00000004] (CPF_Transient)
	float                                              AgentAwareRadius;                              // 0x073C (0x0004) [0x0000000000000000]               
	struct FName                                       CurrentSoundMode;                              // 0x0740 (0x0008) [0x0000000000002000] (CPF_Transient)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GamePlayerController");
		}

		return uClassPointer;
	};

	void ClientColorFade(struct FColor _FadeColor, uint8_t _FromAlpha, uint8_t _ToAlpha, float _FadeTime);
	void eventWarmupPause(bool bDesiredPauseState);
	bool CanUnpauseWarmup();
	void GetCurrentMovie(class FString& MovieName);
	void eventClientStopMovie(float DelayInSeconds, bool bAllowMovieToFinish, bool bForceStopNonSkippable, bool bForceStopLoadingMovie);
	void eventClientPlayMovie(class FString MovieName, int32_t InStartOfRenderingMovieFrame, int32_t InEndOfRenderingMovieFrame, bool bRestrictPausing, bool bPlayOnceFromStream, bool bOnlyBackButtonSkipsMovie);
	static void KeepPlayingLoadingMovie();
	static void ShowLoadingMovie(bool bShowMovie, bool optionalBPauseAfterHide, float optionalPauseDuration, float optionalKeepPlayingDuration, bool optionalBOverridePreviousDelays);
	void SetSoundMode(struct FName InSoundModeName);
	void DoForceFeedbackForScreenShake(class UCameraShake* ShakeData, float Scale);
	void eventNotifyCrowdAgentInRadius(class AGameCrowdAgent* Agent);
	void eventNotifyCrowdAgentRefresh();
	void CrowdDebug(bool bEnabled);
	int32_t GetUIPlayerIndex();
	void OnToggleMouseCursor(class USeqAct_ToggleMouseCursor* inAction);
};

// Class GameFramework.GameCheatManager
// 0x0020 OR 0x00A0 (0x00A0 - 0x0080)
// 32 OR 160 (160 - 128)
class UGameCheatManager : public UCheatManager
{
public:
	class ADebugCameraController*                      DebugCameraControllerRef;                      // 0x0080 (0x0008) [0x0000000000000000]               
	class UClass*                                      DebugCameraControllerClass;                    // 0x0088 (0x0008) [0x0000000000000000]               
	class FString                                      DebugCameraControllerClassName;                // 0x0090 (0x0010) [0x0000000000404000] (CPF_Config | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCheatManager");
		}

		return uClassPointer;
	};

	void OnRequestComplete(class UHttpRequestInterface* OriginalRequest, class UHttpResponseInterface* Response, bool bDidSucceed);
	void TestHttp(class FString Verb, class FString Payload, class FString URL, bool optionalBSendParallelRequest);
	void EnableDebugCamera(bool bEnableDebugText);
	void TeleportPawnToCamera(bool optionalBToggleDebugCameraOff);
	void ToggleDebugCamera(bool optionalBDrawDebugText);
	void PatchDebugCameraController();
};

// Class GameFramework.GameCrowdAgent
// 0x0278 OR 0x04C0 (0x04C0 - 0x0248)
// 632 OR 1216 (1216 - 584)
class AGameCrowdAgent : public ACrowdAgentBase
{
public:
	struct FPointer                                    VfTable_IInterface_RVO;                        // 0x0248 (0x0008) [0x0000000000801002] (CPF_Const | CPF_Native | CPF_NoExport)
	class UGameCrowdGroup*                             MyGroup;                                       // 0x0250 (0x0008) [0x0000000000000000]               
	struct FVector                                     PreferredVelocity;                             // 0x0258 (0x000C) [0x0000000000000000]               
	struct FVector                                     PendingVelocity;                               // 0x0264 (0x000C) [0x0000000000000000]               
	class AGameCrowdDestination*                       CurrentDestination;                            // 0x0270 (0x0008) [0x0000000000000000]               
	class AGameCrowdDestination*                       BehaviorDestination;                           // 0x0278 (0x0008) [0x0000000000000000]               
	class AGameCrowdDestination*                       PreviousDestination;                           // 0x0280 (0x0008) [0x0000000000000000]               
	float                                              InterpZTranslation;                            // 0x0288 (0x0004) [0x0000000000000000]               
	int32_t                                            Health;                                        // 0x028C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DeadBodyDuration;                              // 0x0290 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                              // 0x0294 (0x0008) [0x00000000040A000A] (CPF_Const | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline)
	int32_t                                            ConformTraceFrameCount;                        // 0x029C (0x0004) [0x0000000000002000] (CPF_Transient)
	TArray<struct FNearbyDynamicItem>                  NearbyDynamics;                                // 0x02A0 (0x0010) [0x0000000000402000] (CPF_Transient | CPF_NeedCtorLink)
	uint32_t                                           bUniformScale : 1;                             // 0x02B0 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bCheckForObstacles : 1;                        // 0x02B0 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bUseNavMeshPathing : 1;                        // 0x02B0 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bWantsSeePlayerNotification : 1;               // 0x02B0 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bAllowPitching : 1;                            // 0x02B0 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	uint32_t                                           bHitObstacle : 1;                              // 0x02B0 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bBadHitNormal : 1;                             // 0x02B0 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           bSimulateThisTick : 1;                         // 0x02B0 (0x0004) [0x0000000000000000] [0x00000080] 
	uint32_t                                           bPotentialEncounter : 1;                       // 0x02B0 (0x0004) [0x0000000000000000] [0x00000100] 
	uint32_t                                           bIsPanicked : 1;                               // 0x02B0 (0x0004) [0x0000000000000000] [0x00000200] 
	uint32_t                                           bWantsGroupIdle : 1;                           // 0x02B0 (0x0004) [0x0000000000000000] [0x00000400] 
	uint32_t                                           bPreferVisibleDestination : 1;                 // 0x02B0 (0x0004) [0x0000000000000001] [0x00000800] (CPF_Edit)
	uint32_t                                           bPreferVisibleDestinationOnSpawn : 1;          // 0x02B0 (0x0004) [0x0000000000000001] [0x00001000] (CPF_Edit)
	uint32_t                                           bHasNotifiedSpawner : 1;                       // 0x02B0 (0x0004) [0x0000000000000000] [0x00002000] 
	uint32_t                                           bIsInSpawnPool : 1;                            // 0x02B0 (0x0004) [0x0000000000000000] [0x00004000] 
	uint32_t                                           bPaused : 1;                                   // 0x02B0 (0x0004) [0x0000000000000001] [0x00008000] (CPF_Edit)
	EConformType                                       ConformType;                                   // 0x02B4 (0x0001) [0x0000000000000001] (CPF_Edit)    
	float                                              ConformTraceDist;                              // 0x02B8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            ConformTraceInterval;                          // 0x02BC (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            CurrentConformTraceInterval;                   // 0x02C0 (0x0004) [0x0000000000000000]               
	float                                              LastGroundZ;                                   // 0x02C4 (0x0004) [0x0000000000000000]               
	float                                              AwareRadius;                                   // 0x02C8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AvoidOtherRadius;                              // 0x02CC (0x0004) [0x0000000000000001] (CPF_Edit)    
	TArray<struct FAvoidOtherSampleItem>               AvoidOtherSampleList;                          // 0x02D0 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              PENALTY_COEFF_ANGLETOGOAL;                     // 0x02E0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              PENALTY_COEFF_ANGLETOVEL;                      // 0x02E4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              PENALTY_COEFF_MAG;                             // 0x02E8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MIN_PENALTY_THRESHOLD;                         // 0x02EC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              LastProgressTime;                              // 0x02F0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              LastFallbackActiveTime;                        // 0x02F4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxPathLaneValue;                              // 0x02F8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              CurrentPathLaneValue;                          // 0x02FC (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            ExtraPathCost;                                 // 0x0300 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              RotateToTargetSpeed;                           // 0x0304 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxYawRate;                                    // 0x0308 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     MeshMinScale3D;                                // 0x030C (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     MeshMaxScale3D;                                // 0x0318 (0x000C) [0x0000000000000001] (CPF_Edit)    
	float                                              EyeZOffset;                                    // 0x0324 (0x0004) [0x0000000000000000]               
	float                                              ProximityLODDist;                              // 0x0328 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              VisibleProximityLODDist;                       // 0x032C (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     LastKnownGoodPosition;                         // 0x0330 (0x000C) [0x0000000000000000]               
	float                                              GroundOffset;                                  // 0x033C (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     IntermediatePoint;                             // 0x0340 (0x000C) [0x0000000000000000]               
	struct FVector                                     SearchExtent;                                  // 0x034C (0x000C) [0x0000000000000000]               
	class UClass*                                      NavigationHandleClass;                         // 0x0358 (0x0008) [0x0000000000000000]               
	class UNavigationHandle*                           NavigationHandle;                              // 0x0360 (0x0008) [0x0000000000000000]               
	int32_t                                            ObstacleCheckCount;                            // 0x0368 (0x0004) [0x0000000000000000]               
	float                                              WalkableFloorZ;                                // 0x036C (0x0004) [0x0000000000000000]               
	float                                              LastPathingAttempt;                            // 0x0370 (0x0004) [0x0000000000000000]               
	float                                              LastUpdateTime;                                // 0x0374 (0x0004) [0x0000000000000000]               
	float                                              NotVisibleLifeSpan;                            // 0x0378 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class AGameCrowdAgent*                             MyArchetype;                                   // 0x037C (0x0008) [0x0000000000000000]               
	float                                              MaxWalkingSpeed;                               // 0x0384 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxRunningSpeed;                               // 0x0388 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxSpeed;                                      // 0x038C (0x0004) [0x0000000000000000]               
	TArray<struct FRecentInteraction>                  RecentInteractions;                            // 0x0390 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              BeaconMaxDist;                                 // 0x03A0 (0x0004) [0x0000000000000000]               
	struct FVector                                     BeaconOffset;                                  // 0x03A4 (0x000C) [0x0000000000000000]               
	class UTexture2D*                                  BeaconTexture;                                 // 0x03B0 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FLinearColor                                BeaconColor;                                   // 0x03B8 (0x0010) [0x0000000000000002] (CPF_Const)   
	class USoundCue*                                   AmbientSoundCue;                               // 0x03C8 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UAudioComponent*                             AmbientSoundComponent;                         // 0x03D0 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UGameCrowdAgentBehavior*                     CurrentBehavior;                               // 0x03D8 (0x0008) [0x0000000000000000]               
	float                                              CurrentBehaviorActivationTime;                 // 0x03E0 (0x0004) [0x0000000000000000]               
	TArray<struct FBehaviorEntry>                      EncounterAgentBehaviors;                       // 0x03E4 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FBehaviorEntry>                      SeePlayerBehaviors;                            // 0x03F4 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              MaxSeePlayerDistSq;                            // 0x0404 (0x0004) [0x0000000000000000]               
	float                                              SeePlayerInterval;                             // 0x0408 (0x0004) [0x0000000000000001] (CPF_Edit)    
	TArray<struct FBehaviorEntry>                      SpawnBehaviors;                                // 0x040C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FBehaviorEntry>                      UneasyBehaviors;                               // 0x041C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FBehaviorEntry>                      AlertBehaviors;                                // 0x042C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FBehaviorEntry>                      PanicBehaviors;                                // 0x043C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FBehaviorEntry>                      RandomBehaviors;                               // 0x044C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FBehaviorEntry>                      TakeDamageBehaviors;                           // 0x045C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              RandomBehaviorInterval;                        // 0x046C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ForceUpdateTime;                               // 0x0470 (0x0004) [0x0000000000000000]               
	float                                              ReachThreshold;                                // 0x0474 (0x0004) [0x0000000000000000]               
	TArray<struct FBehaviorEntry>                      GroupWaitingBehaviors;                         // 0x0478 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              DesiredGroupRadius;                            // 0x0488 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DesiredGroupRadiusSq;                          // 0x048C (0x0004) [0x0000000000000000]               
	float                                              MaxLOSLifeDistanceSq;                          // 0x0490 (0x0004) [0x0000000000000000]               
	class UGameCrowdSpawnerInterface*                  MySpawner_Object;                              // 0x0494 (0x0008) [0x0000000000000000] 
	class UGameCrowdSpawnerInterface*                  MySpawner_Interface;                           // 0x049C (0x0008) [0x0000000000000000]               
	struct FVector                                     SpawnOffset;                                   // 0x04A4 (0x000C) [0x0000000000000000]               
	float                                              InitialLastRenderTime;                         // 0x04B0 (0x0004) [0x0000000000000000]               
	struct FColor                                      DebugAgentColor;                               // 0x04B4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class AGameCrowdDestination*                       DebugSpawnDest;                                // 0x04B8 (0x0008) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdAgent");
		}

		return uClassPointer;
	};

	void InitDebugColor();
	class FString GetBehaviorString();
	class FString GetDestString();
	void eventPostRenderFor(class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir);
	struct FVector eventGeneratePathToActor(class AActor* Goal, float optionalWithinDistance, bool optionalBAllowPartialPath);
	void eventInitNavigationHandle();
	void eventOverlappedActorEvent(class AActor* A);
	void TakeDamage(int32_t DamageAmount, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo optionalHitInfo, class AActor* optionalDamageCauser);
	void eventFireDeathEvent();
	void PlayDeath(struct FVector KillMomentum);
	void eventUpdateIntermediatePoint(class AActor* optionalDestinationActor);
	bool CalcCamera(float fDeltaTime, struct FVector& out_CamLoc, struct FRotator& out_CamRot, float& out_FOV);
	bool IsIdle();
	void SetCurrentBehavior(class UGameCrowdAgentBehavior* BehaviorArchetype);
	void eventStopBehavior();
	void eventHandleBehaviorEvent(ECrowdBehaviorEvent EventType, class AActor* InInstigator, bool bViralCause, bool bPropagateViralFlag);
	void ActivateInstancedBehavior(class UGameCrowdAgentBehavior* NewBehaviorObject);
	void eventActivateBehavior(class UGameCrowdAgentBehavior* NewBehaviorArchetype, class AActor* optionalLookAtActor);
	void ResetSeePlayer();
	void TryRandomBehavior();
	void eventNotifySeePlayer(class APlayerController* PC);
	void PlaySpawnBehavior();
	void eventHandlePotentialAgentEncounter();
	void eventStopIdleAnimation();
	void eventPlayIdleAnimation();
	void OnPlayAgentAnimation(class USeqAct_PlayAgentAnimation* Action);
	void InitializeAgent(class AActor* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup, float AgentWarmupTime, bool bWarmupPosition, bool bCheckWarmupVisibility, TArray<struct FCrowdSpawnerPlayerInfo>& PlayerInfo);
	struct FVector GetAttemptedSpawnLocation(float Pct, struct FVector CurPos, float CurRadius, struct FVector DestPos, float DestRadius);
	void SetLighting(bool bEnableLightEnvironment, struct FLightingChannelContainer AgentLightingChannel, bool bCastShadows);
	void DisplayDebug(class AHUD* HUD, float& out_YL, float& out_YPos);
	void Destroyed();
	void ResetPooledAgent();
	void eventKillAgent();
	void PostBeginPlay();
	void SetMaxSpeed();
	void eventSetCurrentDestination(class AGameCrowdDestination* NewDest);
	void eventWaitForGroupMembers();
	bool PickBehaviorFrom(TArray<struct FBehaviorEntry> BehaviorList, struct FVector optionalBestCameraLoc);
	bool IsPanicked();
	void eventFellOutOfWorld(class UClass* dmgType);
	struct FVector GetCollisionExtent();
};

// Class GameFramework.GameCrowdAgentSkeletal
// 0x00B4 OR 0x0574 (0x0574 - 0x04C0)
// 180 OR 1396 (1396 - 1216)
class AGameCrowdAgentSkeletal : public AGameCrowdAgent
{
public:
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                         // 0x04C0 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UAnimNodeBlend*                              SpeedBlendNode;                                // 0x04C8 (0x0008) [0x0000000000000000]               
	class UAnimNodeSlot*                               FullBodySlot;                                  // 0x04D0 (0x0008) [0x0000000000000000]               
	class UAnimNodeSequence*                           ActionSeqNode;                                 // 0x04D8 (0x0008) [0x0000000000000000]               
	class UAnimNodeSequence*                           WalkSeqNode;                                   // 0x04E0 (0x0008) [0x0000000000000000]               
	class UAnimNodeSequence*                           RunSeqNode;                                    // 0x04E8 (0x0008) [0x0000000000000000]               
	class UAnimTree*                                   AgentTree;                                     // 0x04F0 (0x0008) [0x0000000000000000]               
	TArray<struct FName>                               WalkAnimNames;                                 // 0x04F8 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FName>                               RunAnimNames;                                  // 0x0508 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FName>                               IdleAnimNames;                                 // 0x0518 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FName>                               DeathAnimNames;                                // 0x0528 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              SpeedBlendStart;                               // 0x0538 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              SpeedBlendEnd;                                 // 0x053C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AnimVelRate;                                   // 0x0540 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxSpeedBlendChangeSpeed;                      // 0x0544 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       MoveSyncGroupName;                             // 0x0548 (0x0008) [0x0000000000000001] (CPF_Edit)    
	TArray<struct FGameCrowdAttachmentList>            Attachments;                                   // 0x0550 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              MaxTargetAcquireTime;                          // 0x0560 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bUseRootMotionVelocity : 1;                    // 0x0564 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bAllowSkeletonUpdateChangeBasedOnTickResult : 1;// 0x0564 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bTickWhenNotVisible : 1;                       // 0x0564 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bIsPlayingIdleAnimation : 1;                   // 0x0564 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bIsPlayingDeathAnimation : 1;                  // 0x0564 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bIsPlayingImportantAnimation : 1;              // 0x0564 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bAnimateThisTick : 1;                          // 0x0564 (0x0004) [0x0000000000000000] [0x00000040] 
	float                                              NotVisibleDisableTickTime;                     // 0x0568 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxAnimationDistance;                          // 0x056C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxAnimationDistanceSq;                        // 0x0570 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdAgentSkeletal");
		}

		return uClassPointer;
	};

	void CreateAttachments();
	void eventOnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void eventStopIdleAnimation();
	void eventPlayIdleAnimation();
	void eventClearLatentAnimation();
	void OnPlayAgentAnimation(class USeqAct_PlayAgentAnimation* Action);
	void SetRootMotion(bool bRootMotionEnabled);
	void PlayDeath(struct FVector KillMomentum);
	void SetLighting(bool bEnableLightEnvironment, struct FLightingChannelContainer AgentLightingChannel, bool bCastShadows);
	void PostBeginPlay();
};

// Class GameFramework.GameCrowdAgentSM
// 0x0010 OR 0x04D0 (0x04D0 - 0x04C0)
// 16 OR 1232 (1232 - 1216)
class AGameCrowdAgentSM : public AGameCrowdAgent
{
public:
	class UStaticMeshComponent*                        Mesh;                                          // 0x04C0 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UMaterialInstanceConstant*                   MeshColor;                                     // 0x04C8 (0x0008) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdAgentSM");
		}

		return uClassPointer;
	};

	void StopBehavior();
	void ActivateBehavior(class UGameCrowdAgentBehavior* NewBehaviorArchetype, class AActor* optionalLookAtActor);
	void ChangeDebugColor(struct FColor InC);
	void InitDebugColor();
	void PostBeginPlay();
};

// Class GameFramework.GameCrowdAgentBehavior
// 0x003C OR 0x009C (0x009C - 0x0060)
// 60 OR 156 (156 - 96)
class UGameCrowdAgentBehavior : public UObject
{
public:
	ECrowdBehaviorEvent                                MyEventType;                                   // 0x0060 (0x0001) [0x0000000000000000]               
	ECrowdBehaviorEvent                                ViralBehaviorEvent;                            // 0x0061 (0x0001) [0x0000000000000001] (CPF_Edit)    
	float                                              DurationOfBehavior;                            // 0x0064 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              TimeUntilStopBehavior;                         // 0x0068 (0x0004) [0x0000000000000000]               
	uint32_t                                           bIdleBehavior : 1;                             // 0x006C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bFaceActionTargetFirst : 1;                    // 0x006C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bIsViralBehavior : 1;                          // 0x006C (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bPassOnIsViralBehaviorFlag : 1;                // 0x006C (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	class AActor*                                      ActionTarget;                                  // 0x0070 (0x0008) [0x0000000000000000]               
	float                                              MaxPlayerDistance;                             // 0x0078 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ViralRadius;                                   // 0x007C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DurationBeforeBecomesViral;                    // 0x0080 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              TimeToBecomeViral;                             // 0x0084 (0x0004) [0x0000000000002000] (CPF_Transient)
	float                                              DurationOfViralBehaviorPropagation;            // 0x0088 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              TimeToStopPropagatingViralBehavior;            // 0x008C (0x0004) [0x0000000000002000] (CPF_Transient)
	class AGameCrowdAgent*                             MyAgent;                                       // 0x0090 (0x0008) [0x0000000000000000]               
	struct FColor                                      DebugBehaviorColor;                            // 0x0098 (0x0004) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdAgentBehavior");
		}

		return uClassPointer;
	};

	bool AllowBehaviorAt(class AGameCrowdDestination* Destination);
	bool AllowThisDestination(class AGameCrowdDestination* Destination);
	void eventPropagateViralBehaviorTo(class AGameCrowdAgent* OtherAgent);
	class AActor* GetBehaviorInstigator();
	void ActivatedBy(class AActor* NewActionTarget);
	class AActor* GetDestinationActor();
	void ChangingDestination(class AGameCrowdDestination* NewDest);
	class FString GetBehaviorString();
	void eventOnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void StopBehavior();
	void InitBehavior(class AGameCrowdAgent* Agent);
	bool HandleMovement();
	void eventFinishedTargetRotation();
	bool CanBeUsedBy(class AGameCrowdAgent* Agent, struct FVector CameraLoc);
	void eventTick(float DeltaTime);
	bool ShouldEndIdle();
	static class AGameCrowdBehaviorPoint* TriggerCrowdBehavior(ECrowdBehaviorEvent EventType, class AActor* Instigator, struct FVector AtLocation, float InRange, float InDuration, class AActor* optionalBaseActor, bool optionalBRequireLOS);
};

// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x0038 OR 0x00D4 (0x00D4 - 0x009C)
// 56 OR 212 (212 - 156)
class UGameCrowdBehavior_PlayAnimation : public UGameCrowdAgentBehavior
{
public:
	TArray<struct FName>                               AnimationList;                                 // 0x009C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              BlendInTime;                                   // 0x00AC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BlendOutTime;                                  // 0x00B0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bUseRootMotion : 1;                            // 0x00B4 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bLookAtPlayer : 1;                             // 0x00B4 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bLooping : 1;                                  // 0x00B4 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bBlendBetweenAnims : 1;                        // 0x00B4 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	class AActor*                                      CustomActionTarget;                            // 0x00B8 (0x0008) [0x0000000000000000]               
	int32_t                                            LoopIndex;                                     // 0x00C0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              LoopTime;                                      // 0x00C4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class USeqAct_PlayAgentAnimation*                  AnimSequence;                                  // 0x00C8 (0x0008) [0x0000000000000000]               
	int32_t                                            AnimationIndex;                                // 0x00D0 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehavior_PlayAnimation");
		}

		return uClassPointer;
	};

	class FString GetBehaviorString();
	void StopBehavior();
	void PlayAgentAnimationNow();
	void eventOnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void SetSequenceOutput();
	void eventFinishedTargetRotation();
	void InitBehavior(class AGameCrowdAgent* Agent);
};

// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x0008 OR 0x00A4 (0x00A4 - 0x009C)
// 8 OR 164 (164 - 156)
class UGameCrowdBehavior_RunFromPanic : public UGameCrowdAgentBehavior
{
public:
	class AActor*                                      PanicFocus;                                    // 0x009C (0x0008) [0x0000000000002000] (CPF_Transient)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehavior_RunFromPanic");
		}

		return uClassPointer;
	};

	class FString GetBehaviorString();
	bool AllowBehaviorAt(class AGameCrowdDestination* Destination);
	bool AllowThisDestination(class AGameCrowdDestination* Destination);
	class AActor* GetBehaviorInstigator();
	void StopBehavior();
	void InitBehavior(class AGameCrowdAgent* Agent);
	void ActivatedBy(class AActor* NewActionTarget);
};

// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x0000 OR 0x009C (0x009C - 0x009C)
// 0 OR 156 (156 - 156)
class UGameCrowdBehavior_WaitForGroup : public UGameCrowdAgentBehavior
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitForGroup");
		}

		return uClassPointer;
	};

	void StopBehavior();
	bool ShouldEndIdle();
	class FString GetBehaviorString();
	void InitBehavior(class AGameCrowdAgent* Agent);
};

// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x000C OR 0x00A8 (0x00A8 - 0x009C)
// 12 OR 168 (168 - 156)
class UGameCrowdBehavior_WaitInQueue : public UGameCrowdAgentBehavior
{
public:
	uint32_t                                           bStoppingBehavior : 1;                         // 0x009C (0x0004) [0x0000000000000000] [0x00000001] 
	class AGameCrowdDestinationQueuePoint*             QueuePosition;                                 // 0x00A0 (0x0008) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitInQueue");
		}

		return uClassPointer;
	};

	void StopBehavior();
	bool ShouldEndIdle();
	class FString GetBehaviorString();
	class AActor* GetDestinationActor();
	void ChangingDestination(class AGameCrowdDestination* NewDest);
	bool HandleMovement();
};

// Class GameFramework.GameCrowdGroup
// 0x0010 OR 0x0070 (0x0070 - 0x0060)
// 16 OR 112 (112 - 96)
class UGameCrowdGroup : public UObject
{
public:
	TArray<class AGameCrowdAgent*>                     Members;                                       // 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdGroup");
		}

		return uClassPointer;
	};

	void UpdateDestinations(class AGameCrowdDestination* NewDestination);
	void RemoveMember(class AGameCrowdAgent* Agent);
	void AddMember(class AGameCrowdAgent* Agent);
};

// Class GameFramework.GameCrowdInfoVolume
// 0x0010 OR 0x028C (0x028C - 0x027C)
// 16 OR 652 (652 - 636)
class AGameCrowdInfoVolume : public AVolume
{
public:
	TArray<class AGameCrowdDestination*>               PotentialSpawnPoints;                          // 0x027C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdInfoVolume");
		}

		return uClassPointer;
	};

	void UnTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal);
};

// Class GameFramework.GameCrowdInteractionPoint
// 0x000C OR 0x024C (0x024C - 0x0240)
// 12 OR 588 (588 - 576)
class AGameCrowdInteractionPoint : public AActor
{
public:
	uint32_t                                           bIsEnabled : 1;                                // 0x0240 (0x0004) [0x0000000000000021] [0x00000001] (CPF_Edit | CPF_Net)
	class UCylinderComponent*                          CylinderComponent;                             // 0x0244 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdInteractionPoint");
		}

		return uClassPointer;
	};

	void OnToggle(class USeqAct_Toggle* Action);
};

// Class GameFramework.GameCrowdBehaviorPoint
// 0x0018 OR 0x0264 (0x0264 - 0x024C)
// 24 OR 612 (612 - 588)
class AGameCrowdBehaviorPoint : public AGameCrowdInteractionPoint
{
public:
	float                                              RadiusOfBehaviorEvent;                         // 0x024C (0x0004) [0x0000000000004000] (CPF_Config)  
	float                                              DurationOfBehaviorEvent;                       // 0x0250 (0x0004) [0x0000000000004000] (CPF_Config)  
	ECrowdBehaviorEvent                                EventType;                                     // 0x0254 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bRequireLOS : 1;                               // 0x0258 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	class AActor*                                      Initiator;                                     // 0x025C (0x0008) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehaviorPoint");
		}

		return uClassPointer;
	};

	void eventTouch(class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal);
	void DestroySelf();
	void eventPostBeginPlay();
};

// Class GameFramework.GameCrowdDestination
// 0x00A8 OR 0x02F4 (0x02F4 - 0x024C)
// 168 OR 756 (756 - 588)
class AGameCrowdDestination : public AGameCrowdInteractionPoint
{
public:
	struct FPointer                                    VfTable_IEditorLinkSelectionInterface;         // 0x024C (0x0008) [0x0000000000801002] (CPF_Const | CPF_Native | CPF_NoExport)
	uint32_t                                           bKillWhenReached : 1;                          // 0x0254 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bAllowAsPreviousDestination : 1;               // 0x0254 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bAvoidWhenPanicked : 1;                        // 0x0254 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bSkipBehaviorIfPanicked : 1;                   // 0x0254 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bFleeDestination : 1;                          // 0x0254 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
