/*
#############################################################################################
# Outlast (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: OLGame_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function OLGame.OLBashableObject.OnToggle
// [0x00020002] 
struct AOLBashableObject_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLBashableObject.ClearBreakTimer
// [0x00020002] 
struct AOLBashableObject_execClearBreakTimer_Params
{
};

// Function OLGame.OLBashableObject.TriggerBreakTimer
// [0x00020002] 
struct AOLBashableObject_execTriggerBreakTimer_Params
{
	float                                              Time;                                             		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLBashableObject.Break
// [0x00020002] 
struct AOLBashableObject_execBreak_Params
{
};

// Function OLGame.OLCamcorderHud.UpdateRecordingTime
// [0x00020002] 
struct UOLCamcorderHud_execUpdateRecordingTime_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                            TotalSeconds;                                     		// 0x0004 (0x0004) [0x0000000000000000]               
	// class FString                                      Hours;                                            		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      Minutes;                                          		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      Seconds;                                          		// 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      HundredthsOfASecond;                              		// 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      DisplayedTime;                                    		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function OLGame.OLCamcorderHud.WidgetInitialized
// [0x00020802] 
struct UOLCamcorderHud_eventWidgetInitialized_Params
{
	struct FName                                       WidgetName;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       WidgetPath;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UGFxObject*                                  Widget;                                           		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderHud.SetVisible
// [0x00020802] 
struct UOLCamcorderHud_eventSetVisible_Params
{
	uint32_t                                           bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLCameraActor.GetCameraView
// [0x00420102] 
struct AOLCameraActor_execGetCameraView_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTPOV                                       OutPOV;                                           		// 0x0004 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function OLGame.OLCameraActor.NativeGetCameraView
// [0x00420400] 
struct AOLCameraActor_execNativeGetCameraView_Params
{
	struct FTPOV                                       OutPOV;                                           		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function OLGame.OLPlayerController.UnlockAchievement
// [0x00020802] 
struct AOLPlayerController_eventUnlockAchievement_Params
{
	uint8_t                                            achievement;                                      		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                            ControllerId;                                     		// 0x0004 (0x0004) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.NotifyDifficultyChanged
// [0x00020002] 
struct AOLPlayerController_execNotifyDifficultyChanged_Params
{
	// class AOLBot*                                      Bot;                                              		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.UpdateDifficultyBasedValues
// [0x00020002] 
struct AOLPlayerController_execUpdateDifficultyBasedValues_Params
{
	// class AOLGame*                                     TheGame;                                          		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.CheckForProfileUpdate
// [0x00020802] 
struct AOLPlayerController_eventCheckForProfileUpdate_Params
{
};

// Function OLGame.OLPlayerController.UpdateLocalCacheOfProfileSettings
// [0x00020802] 
struct AOLPlayerController_eventUpdateLocalCacheOfProfileSettings_Params
{
	class UOLProfileSettings*                          EffectiveProfileSettings;                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// float                                              FloatValue;                                       		// 0x0008 (0x0004) [0x0000000000000000]               
	// int32_t                                            IntValue;                                         		// 0x000C (0x0004) [0x0000000000000000]               
	// class UOLEngine*                                   TheEngine;                                        		// 0x0010 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.ClientSaveAllPlayerData
// [0xFFFF0000010241C2] 
struct AOLPlayerController_execClientSaveAllPlayerData_Params
{
	uint32_t                                           bShouldForce : 1;                                 		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bSkipCacheUpdate : 1;                             		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	// class ULocalPlayer*                                LP;                                               		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.OnProfileWriteComplete
// [0x00020002] 
struct AOLPlayerController_execOnProfileWriteComplete_Params
{
	uint8_t                                            LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bWasSuccessful : 1;                               		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.ClearSaveProfileDelegate
// [0x00020002] 
struct AOLPlayerController_execClearSaveProfileDelegate_Params
{
	int32_t                                            ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             WriteProfileSettingsCompleteDelegate;             		// 0x0004 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// class UOnlinePlayerInterface*                      PlayerInt;                                        		// 0x0014 (0x0010) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.SaveProfile
// [0x00040803] 
struct AOLPlayerController_eventSaveProfile_Params
{
	// int32_t                                            ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.UnregisterPlayerDataStores
// [0x00020102] 
struct AOLPlayerController_execUnregisterPlayerDataStores_Params
{
	// class ULocalPlayer*                                LP;                                               		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.RegisterCustomPlayerDataStores
// [0x00080102] 
struct AOLPlayerController_execRegisterCustomPlayerDataStores_Params
{
	// class ULocalPlayer*                                LP;                                               		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.ShippingCheat_GiveAllCheckpoints
// [0x00020400] 
struct AOLPlayerController_execShippingCheat_GiveAllCheckpoints_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.ClearAllProgress
// [0x00020400] 
struct AOLPlayerController_execClearAllProgress_Params
{
};

// Function OLGame.OLPlayerController.SaveBeforeQuitting
// [0x00020400] 
struct AOLPlayerController_execSaveBeforeQuitting_Params
{
};

// Function OLGame.OLPlayerController.ClientCommitMapChange
// [0xFFFF0000010209C2] 
struct AOLPlayerController_eventClientCommitMapChange_Params
{
};

// Function OLGame.OLPlayerController.StartNewGameAtCheckpoint
// [0x00020802] 
struct AOLPlayerController_eventStartNewGameAtCheckpoint_Params
{
	class FString                                      CheckpointStr;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           bSaveToDisk : 1;                                  		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class AOLCheckpoint*                               CheckCP;                                          		// 0x0014 (0x0008) [0x0000000000000000]               
	// class AOLCheckpoint*                               startCP;                                          		// 0x001C (0x0008) [0x0000000000000000]               
	// class AOLHero*                                     Hero;                                             		// 0x0024 (0x0008) [0x0000000000000000]               
	// class AOLGame*                                     CurrentGame;                                      		// 0x002C (0x0008) [0x0000000000000000]               
	// class UOLEngine*                                   Engine;                                           		// 0x0034 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.ApplyDeprecatedCheckpointRecord
// [0x00C20002] 
struct AOLPlayerController_execApplyDeprecatedCheckpointRecord_Params
{
	struct FDeprecatedCheckpointRecord                 OldRecord;                                        		// 0x0000 (0x0084) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	// class AOLGame*                                     CurrentGame;                                      		// 0x0084 (0x0008) [0x0000000000000000]               
	// struct AOLPlayerController_FCheckpointRecord       NewRecord;                                        		// 0x008C (0x0090) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.ApplyCheckpointRecord
// [0x00420002] 
struct AOLPlayerController_execApplyCheckpointRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x0090) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.CreateCheckpointRecord
// [0x00420002] 
struct AOLPlayerController_execCreateCheckpointRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x0090) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.NativeApplyCheckpointRecord
// [0x00420400] 
struct AOLPlayerController_execNativeApplyCheckpointRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x0090) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.NativeCreateCheckpointRecord
// [0x00420400] 
struct AOLPlayerController_execNativeCreateCheckpointRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x0090) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.SavePersistentState
// [0x00020400] 
struct AOLPlayerController_execSavePersistentState_Params
{
};

// Function OLGame.OLPlayerController.OnOverrideAIMusic
// [0x00020002] 
struct AOLPlayerController_execOnOverrideAIMusic_Params
{
	class UOLSeqAct_OverrideAIMusic*                   Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.StopAllSounds
// [0x00020400] 
struct AOLPlayerController_execStopAllSounds_Params
{
};

// Function OLGame.OLPlayerController.DisplayDebug
// [0x00420102] 
struct AOLPlayerController_execDisplayDebug_Params
{
	class AHUD*                                        H;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              out_YL;                                           		// 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_YPos;                                         		// 0x000C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	// class AOLGame*                                     CurrentGame;                                      		// 0x0010 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.DrawHUD
// [0x00020002] 
struct AOLPlayerController_execDrawHUD_Params
{
	class AHUD*                                        H;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AOLHUD*                                      OLHUD;                                            		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.FullScreenOverlayChanged
// [0x00020802] 
struct AOLPlayerController_eventFullScreenOverlayChanged_Params
{
};

// Function OLGame.OLPlayerController.ForcePause
// [0x00020802] 
struct AOLPlayerController_eventForcePause_Params
{
	uint32_t                                           bPause : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.ClientSetHUD
// [0xFFFF0000010201C2] 
struct AOLPlayerController_execClientSetHUD_Params
{
	class UClass*                                      newHUDType;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.OnSetMesh
// [0x00020802] 
struct AOLPlayerController_eventOnSetMesh_Params
{
	class USeqAct_SetMesh*                             Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.ClientSetCameraFade
// [0xFFFF0000010249C2] 
struct AOLPlayerController_eventClientSetCameraFade_Params
{
	uint32_t                                           _enableFading : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	struct FColor                                      _FadeColor;                                       		// 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FVector2D                                   _FadeAlpha;                                       		// 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              _FadeTime;                                        		// 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           _fadeAudio : 1;                                   		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLPlayerController.SetCinematicMode
// [0x00020002] 
struct AOLPlayerController_execSetCinematicMode_Params
{
	class USeqAct_ToggleCinematicMode*                 Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bInCinematicMode : 1;                             		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bHidePlayer : 1;                                  		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bAffectsHUD : 1;                                  		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bAffectsMovement : 1;                             		// 0x0014 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bAffectsTurning : 1;                              		// 0x0018 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bAffectsButtons : 1;                              		// 0x001C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.GetPlayerViewPoint
// [0x00420902] 
struct AOLPlayerController_eventGetPlayerViewPoint_Params
{
	struct FVector                                     POVLocation;                                      		// 0x0000 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    POVRotation;                                      		// 0x000C (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function OLGame.OLPlayerController.GetFOVAngle
// [0x00020802] 
struct AOLPlayerController_eventGetFOVAngle_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class ACameraActor*                                CamActor;                                         		// 0x0004 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.SpawnCamera
// [0x00020002] 
struct AOLPlayerController_execSpawnCamera_Params
{
	// class AActor*                                      OldViewTarget;                                    		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.SetCameraMode
// [0x00020002] 
struct AOLPlayerController_execSetCameraMode_Params
{
	struct FName                                       NewCamMode;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.UsingFirstPersonCamera
// [0x00020002] 
struct AOLPlayerController_execUsingFirstPersonCamera_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.SetBehindView
// [0x00020002] 
struct AOLPlayerController_execSetBehindView_Params
{
	uint32_t                                           bNewBehindView : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.BehindView
// [0x00020202] 
struct AOLPlayerController_execBehindView_Params
{
};

// Function OLGame.OLPlayerController.GammaCalibration
// [0x00020202] 
struct AOLPlayerController_execGammaCalibration_Params
{
};

// Function OLGame.OLPlayerController.PressedJump
// [0x00020202] 
struct AOLPlayerController_execPressedJump_Params
{
};

// Function OLGame.OLPlayerController.PressedReloadBatteries
// [0x00020202] 
struct AOLPlayerController_execPressedReloadBatteries_Params
{
};

// Function OLGame.OLPlayerController.StopZoom
// [0x00020302] 
struct AOLPlayerController_execStopZoom_Params
{
};

// Function OLGame.OLPlayerController.StartZoomOut
// [0x00020302] 
struct AOLPlayerController_execStartZoomOut_Params
{
};

// Function OLGame.OLPlayerController.StartZoomIn
// [0x00020302] 
struct AOLPlayerController_execStartZoomIn_Params
{
};

// Function OLGame.OLPlayerController.ZoomOut
// [0x00020202] 
struct AOLPlayerController_execZoomOut_Params
{
};

// Function OLGame.OLPlayerController.ZoomIn
// [0x00020202] 
struct AOLPlayerController_execZoomIn_Params
{
};

// Function OLGame.OLPlayerController.ToggleCamcorder
// [0x00020202] 
struct AOLPlayerController_execToggleCamcorder_Params
{
};

// Function OLGame.OLPlayerController.ToggleNightVision
// [0x00020202] 
struct AOLPlayerController_execToggleNightVision_Params
{
};

// Function OLGame.OLPlayerController.ReleasedUseButton
// [0x00020202] 
struct AOLPlayerController_execReleasedUseButton_Params
{
};

// Function OLGame.OLPlayerController.PressedUseButton
// [0x00020202] 
struct AOLPlayerController_execPressedUseButton_Params
{
};

// Function OLGame.OLPlayerController.PerformedUseAction
// [0x00020102] 
struct AOLPlayerController_execPerformedUseAction_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.SetPlayerFoundWhileHidden
// [0x00020400] 
struct AOLPlayerController_execSetPlayerFoundWhileHidden_Params
{
	class AOLEnemyPawn*                                SearchingEnemy;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.IsPlayerFindableWhileHidden
// [0x00020400] 
struct AOLPlayerController_execIsPlayerFindableWhileHidden_Params
{
	class AOLEnemyPawn*                                SearchingEnemy;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.PlayerDied
// [0x00020002] 
struct AOLPlayerController_execPlayerDied_Params
{
};

// Function OLGame.OLPlayerController.Destroyed
// [0x00020802] 
struct AOLPlayerController_eventDestroyed_Params
{
};

// Function OLGame.OLPlayerController.ClientRestart
// [0xFFFF0000010201C2] 
struct AOLPlayerController_execClientRestart_Params
{
	class APawn*                                       NewPawn;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.Reset
// [0x00020002] 
struct AOLPlayerController_execReset_Params
{
};

// Function OLGame.OLPlayerController.UnPossess
// [0x00020802] 
struct AOLPlayerController_eventUnPossess_Params
{
};

// Function OLGame.OLPlayerController.Possess
// [0x00020802] 
struct AOLPlayerController_eventPossess_Params
{
	class APawn*                                       inPawn;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bVehicleTransition : 1;                           		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.PostBeginPlay
// [0x00020902] 
struct AOLPlayerController_eventPostBeginPlay_Params
{
};

// Function OLGame.OLPlayerController.HideLoadingOverlay
// [0x00020400] 
struct AOLPlayerController_execHideLoadingOverlay_Params
{
};

// Function OLGame.OLPlayerController.ShowLoadingOverlay
// [0x00020400] 
struct AOLPlayerController_execShowLoadingOverlay_Params
{
};

// Function OLGame.OLPlayerController.SetVolume
// [0x00020400] 
struct AOLPlayerController_execSetVolume_Params
{
	float                                              VolumeLevel;                                      		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.SetGamma
// [0x00020400] 
struct AOLPlayerController_execSetGamma_Params
{
	float                                              GammaValue;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.GetGamma
// [0x00020400] 
struct AOLPlayerController_execGetGamma_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.NativePlayerMove
// [0x00020400] 
struct AOLPlayerController_execNativePlayerMove_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCheatManager.SetLanguage
// [0x00020600] 
struct UOLCheatManager_execSetLanguage_Params
{
	class FString                                      LanguageCode;                                     		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCheatManager.ReloadSoundBanks
// [0x00020600] 
struct UOLCheatManager_execReloadSoundBanks_Params
{
	uint32_t                                           bDLC : 1;                                         		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLCheatManager.ProcessCheatInput
// [0x00020802] 
struct UOLCheatManager_eventProcessCheatInput_Params
{
	class UOLPlayerInput*                              InputMgr;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       Key;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCheatManager.IsViewModeUnlit
// [0x00020400] 
struct UOLCheatManager_execIsViewModeUnlit_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCheatManager.SetFinishedGame
// [0x00020202] 
struct UOLCheatManager_execSetFinishedGame_Params
{
	uint32_t                                           hasFinishedGame : 1;                              		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           hasFinishedDLC : 1;                               		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLCheatManager.OutlastPause
// [0x00020202] 
struct UOLCheatManager_execOutlastPause_Params
{
};

// Function OLGame.OLCheatManager.ResetGS
// [0x00020600] 
struct UOLCheatManager_execResetGS_Params
{
};

// Function OLGame.OLCheatManager.ActivateGS
// [0x00020600] 
struct UOLCheatManager_execActivateGS_Params
{
	struct FName                                       gsName;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCheatManager.DumpGS
// [0x00020202] 
struct UOLCheatManager_execDumpGS_Params
{
};

// Function OLGame.OLCheatManager.DebugGameState
// [0x00020202] 
struct UOLCheatManager_execDebugGameState_Params
{
};

// Function OLGame.OLCheatManager.SuppressAllMessages
// [0x00020202] 
struct UOLCheatManager_execSuppressAllMessages_Params
{
};

// Function OLGame.OLCheatManager.DrawDebug
// [0x00020400] 
struct UOLCheatManager_execDrawDebug_Params
{
};

// Function OLGame.OLCheatManager.ToggleMute
// [0x00020600] 
struct UOLCheatManager_execToggleMute_Params
{
};

// Function OLGame.OLCheatManager.InflictDamage
// [0x00024202] 
struct UOLCheatManager_execInflictDamage_Params
{
	float                                              Amount;                                           		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLCheatManager.ResetWorldState
// [0x00020600] 
struct UOLCheatManager_execResetWorldState_Params
{
};

// Function OLGame.OLCheatManager.ResetPushables
// [0x00020600] 
struct UOLCheatManager_execResetPushables_Params
{
};

// Function OLGame.OLCheatManager.ResetDoors
// [0x00020600] 
struct UOLCheatManager_execResetDoors_Params
{
};

// Function OLGame.OLCheatManager.SetGamma
// [0x00020600] 
struct UOLCheatManager_execSetGamma_Params
{
	float                                              newGamma;                                         		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCheatManager.DemoMode
// [0x00020202] 
struct UOLCheatManager_execDemoMode_Params
{
	// class AOLGame*                                     OLGame;                                           		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCheatManager.LoadGame
// [0x00020202] 
struct UOLCheatManager_execLoadGame_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// class UOLEngine*                                   Engine;                                           		// 0x0010 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCheatManager.SaveGame
// [0x00020202] 
struct UOLCheatManager_execSaveGame_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// class UOLEngine*                                   Engine;                                           		// 0x0010 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCheatManager.GiveItem
// [0x00020600] 
struct UOLCheatManager_execGiveItem_Params
{
	class FString                                      ItemName;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCheatManager.ApplyCP
// [0x00020600] 
struct UOLCheatManager_execApplyCP_Params
{
	class FString                                      CPName;                                           		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCheatManager.cplist
// [0x00020600] 
struct UOLCheatManager_execcplist_Params
{
};

// Function OLGame.OLCheatManager.cp
// [0x00020202] 
struct UOLCheatManager_execcp_Params
{
	class FString                                      CPName;                                           		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCheatManager.Checkpoint
// [0x00020202] 
struct UOLCheatManager_execCheckpoint_Params
{
	class FString                                      CPName;                                           		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCheatManager.KillFade
// [0x00020202] 
struct UOLCheatManager_execKillFade_Params
{
};

// Function OLGame.OLCheatManager.ToggleUnlimitedBatteries
// [0x00020202] 
struct UOLCheatManager_execToggleUnlimitedBatteries_Params
{
};

// Function OLGame.OLCheatManager.RechargeNightVision
// [0x00020202] 
struct UOLCheatManager_execRechargeNightVision_Params
{
	// int32_t                                            nbBatAdded;                                       		// 0x0000 (0x0004) [0x0000000000000000]               
};

// Function OLGame.OLCheatManager.Ghost
// [0x00020202] 
struct UOLCheatManager_execGhost_Params
{
};

// Function OLGame.OLCheatManager.GhostPawn
// [0x00020400] 
struct UOLCheatManager_execGhostPawn_Params
{
	uint32_t                                           ghosting : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLCheatManager.FasterGameSpeed
// [0x00020202] 
struct UOLCheatManager_execFasterGameSpeed_Params
{
};

// Function OLGame.OLCheatManager.SlowerGameSpeed
// [0x00020202] 
struct UOLCheatManager_execSlowerGameSpeed_Params
{
};

// Function OLGame.OLCheatManager.NormalGameSpeed
// [0x00020202] 
struct UOLCheatManager_execNormalGameSpeed_Params
{
};

// Function OLGame.OLCheatManager.UpdateGameSpeed
// [0x00020002] 
struct UOLCheatManager_execUpdateGameSpeed_Params
{
};

// Function OLGame.OLCheatManager.SingleFrame
// [0x00020600] 
struct UOLCheatManager_execSingleFrame_Params
{
};

// Function OLGame.OLCheatManager.TeleportToFreeCam
// [0x00020202] 
struct UOLCheatManager_execTeleportToFreeCam_Params
{
};

// Function OLGame.OLCheatManager.ToggleFixedCam
// [0x00020202] 
struct UOLCheatManager_execToggleFixedCam_Params
{
};

// Function OLGame.OLCheatManager.ToggleFreeCamNoPause
// [0x00020202] 
struct UOLCheatManager_execToggleFreeCamNoPause_Params
{
};

// Function OLGame.OLCheatManager.ToggleFreeCam
// [0x00020202] 
struct UOLCheatManager_execToggleFreeCam_Params
{
};

// Function OLGame.OLCheatManager.AutoSpike
// [0x00024202] 
struct UOLCheatManager_execAutoSpike_Params
{
	float                                              Spike;                                            		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              Delay;                                            		// 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLCheatManager.Spike
// [0x00024202] 
struct UOLCheatManager_execSpike_Params
{
	float                                              Spike;                                            		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLCheatManager.BadFPS
// [0x00024202] 
struct UOLCheatManager_execBadFPS_Params
{
	float                                              slowdown;                                         		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLCheatManager.DebugAIPositions
// [0x00020202] 
struct UOLCheatManager_execDebugAIPositions_Params
{
};

// Function OLGame.OLCheatManager.DebugAI
// [0x00020202] 
struct UOLCheatManager_execDebugAI_Params
{
};

// Function OLGame.OLCheatManager.ShowHeroDebug
// [0x00020202] 
struct UOLCheatManager_execShowHeroDebug_Params
{
};

// Function OLGame.OLCheatManager.ShowPaths
// [0x00020202] 
struct UOLCheatManager_execShowPaths_Params
{
};

// Function OLGame.OLCheatManager.ShowStatLevels
// [0x00020202] 
struct UOLCheatManager_execShowStatLevels_Params
{
};

// Function OLGame.OLCheatManager.DebugWaitPoints
// [0x00020202] 
struct UOLCheatManager_execDebugWaitPoints_Params
{
};

// Function OLGame.OLCheatManager.DebugTrajectory
// [0x00020202] 
struct UOLCheatManager_execDebugTrajectory_Params
{
};

// Function OLGame.OLCheatManager.DebugCamera
// [0x00020202] 
struct UOLCheatManager_execDebugCamera_Params
{
};

// Function OLGame.OLCheatManager.DebugSoundEnvironment
// [0x00024600] 
struct UOLCheatManager_execDebugSoundEnvironment_Params
{
	class FString                                      Filter;                                           		// 0x0000 (0x0010) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCheatManager.DebugGameplay
// [0x00020600] 
struct UOLCheatManager_execDebugGameplay_Params
{
};

// Function OLGame.OLCheatManager.SaveAllCheckpoints
// [0x00020600] 
struct UOLCheatManager_execSaveAllCheckpoints_Params
{
};

// Function OLGame.OLCheatManager.DeleteAllSaves
// [0x00020600] 
struct UOLCheatManager_execDeleteAllSaves_Params
{
};

// Function OLGame.OLCheatManager.KillAll
// [0x00020202] 
struct UOLCheatManager_execKillAll_Params
{
	class UClass*                                      aClass;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCheatManager.ToggleCheats
// [0x00020202] 
struct UOLCheatManager_execToggleCheats_Params
{
};

// Function OLGame.OLCheatManager.GetCheatManager
// [0x00022400] 
struct UOLCheatManager_execGetCheatManager_Params
{
	class UOLCheatManager*                             ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCheatManager.AddDebugTrajectoryPoint
// [0x00020400] 
struct UOLCheatManager_execAddDebugTrajectoryPoint_Params
{
	struct FDebugTrajectoryPoint                       Point;                                            		// 0x0000 (0x0018) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCheckpoint.OnToggle
// [0x00020102] 
struct AOLCheckpoint_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AOLGame*                                     CurrentGame;                                      		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCheckpoint.SetEnabled
// [0x00020002] 
struct AOLCheckpoint_execSetEnabled_Params
{
	uint32_t                                           bEnable : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class AOLGame*                                     CurrentGame;                                      		// 0x0004 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCheckpoint.ResetCheckpointDeaths
// [0x00020400] 
struct AOLCheckpoint_execResetCheckpointDeaths_Params
{
};

// Function OLGame.OLCheckpoint.OnPlayerSpawn
// [0x00020400] 
struct AOLCheckpoint_execOnPlayerSpawn_Params
{
};

// Function OLGame.OLCheckpointList.Script_IsUnreached
// [0x00422400] 
struct AOLCheckpointList_execScript_IsUnreached_Params
{
	struct FName                                       TestCheckpoint;                                   		// 0x0000 (0x0008) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FName                                       CurrentCheckpoint;                                		// 0x0008 (0x0008) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCheckpointSave.CheckpointIsEmpty
// [0x00020803] 
struct UOLCheckpointSave_eventCheckpointIsEmpty_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLConsole.InputKey
// [0x00024002] 
struct UOLConsole_execInputKey_Params
{
	int32_t                                            ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       Key;                                              		// 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            Event;                                            		// 0x000C (0x0001) [0x0000000000000080] (CPF_Parm)    
	float                                              AmountDepressed;                                  		// 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bGamepad : 1;                                     		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UOLCheatManager*                             CheatMgr;                                         		// 0x001C (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLConsole.AddCustomCommandsToAutoComplete
// [0x00020400] 
struct UOLConsole_execAddCustomCommandsToAutoComplete_Params
{
};

// Function OLGame.OLDarknessVolume.OnToggle
// [0x00020102] 
struct AOLDarknessVolume_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLDLCManager.FindAndInstallDLC
// [0x00020400] 
struct UOLDLCManager_execFindAndInstallDLC_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLDoor.BreakDoor
// [0x00020802] 
struct AOLDoor_eventBreakDoor_Params
{
	class AOLPawn*                                     Breaker;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bReversed : 1;                                    		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLDoor.BashDoor
// [0x00020802] 
struct AOLDoor_eventBashDoor_Params
{
	uint32_t                                           bReversed : 1;                                    		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// struct FName                                       BreakAnim;                                        		// 0x0004 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLDoor.ShouldBreak
// [0x00020802] 
struct AOLDoor_eventShouldBreak_Params
{
	class AOLBot*                                      Bot;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLDoor.OnDestroy
// [0x00020102] 
struct AOLDoor_execOnDestroy_Params
{
	class USeqAct_Destroy*                             Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLDoor.SoftDestroy
// [0x00020400] 
struct AOLDoor_execSoftDestroy_Params
{
};

// Function OLGame.OLDoor.NotifyHandlesToWait
// [0x00020400] 
struct AOLDoor_execNotifyHandlesToWait_Params
{
};

// Function OLGame.OLDoor.NotifyHandlesToRepath
// [0x00020400] 
struct AOLDoor_execNotifyHandlesToRepath_Params
{
};

// Function OLGame.OLDoor.GetOpenAngle
// [0x00020400] 
struct AOLDoor_execGetOpenAngle_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLDoor.TriggerEvent
// [0x00020400] 
struct AOLDoor_execTriggerEvent_Params
{
	uint8_t                                            EventType;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class AOLPawn*                                     Triggerer;                                        		// 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLDoor.TriggerBreakDoorCameraShake
// [0x00020400] 
struct AOLDoor_execTriggerBreakDoorCameraShake_Params
{
};

// Function OLGame.OLDoor.StopShaking
// [0x00020400] 
struct AOLDoor_execStopShaking_Params
{
};

// Function OLGame.OLDoor.StartShaking
// [0x00024400] 
struct AOLDoor_execStartShaking_Params
{
	struct FDoorShakeData                              ShakeParams;                                      		// 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bSwitchToBreakingMesh : 1;                        		// 0x0040 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bReversed : 1;                                    		// 0x0044 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bFromAI : 1;                                      		// 0x0048 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLDoor.IsBroken
// [0x00020002] 
struct AOLDoor_execIsBroken_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLDoor.UnregisterNavmeshObstacle
// [0x00020401] 
struct AOLDoor_execUnregisterNavmeshObstacle_Params
{
};

// Function OLGame.OLDoor.RegisterNavMeshObstacle
// [0x00020401] 
struct AOLDoor_execRegisterNavMeshObstacle_Params
{
};

// Function OLGame.OLDoor.ScriptGetCenterLocation
// [0x00020400] 
struct AOLDoor_execScriptGetCenterLocation_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLElectrifiedVolume.Touch
// [0x00020902] 
struct AOLElectrifiedVolume_eventTouch_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitNormal;                                        		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
	// class AOLHero*                                     Hero;                                             		// 0x0028 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLElectrifiedVolume.OnToggle
// [0x00020102] 
struct AOLElectrifiedVolume_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLElectrifiedWaterVolume.OnToggle
// [0x00020102] 
struct AOLElectrifiedWaterVolume_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLEngine.UpdateProfileKeyBindingsFromSystem
// [0x00020400] 
struct UOLEngine_execUpdateProfileKeyBindingsFromSystem_Params
{
	class UOLProfileSettings*                          ProfileSettings;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.UpdateProfileFromSystemSettings
// [0x00020400] 
struct UOLEngine_execUpdateProfileFromSystemSettings_Params
{
	class UOLProfileSettings*                          ProfileSettings;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.ApplyKeyBindings
// [0x00020400] 
struct UOLEngine_execApplyKeyBindings_Params
{
	class UOLProfileSettings*                          ProfileSettings;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.ApplySystemSettings
// [0x00020400] 
struct UOLEngine_execApplySystemSettings_Params
{
	class UOLProfileSettings*                          ProfileSettings;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.LoadMostRecentSaveFile
// [0x00020400] 
struct UOLEngine_execLoadMostRecentSaveFile_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.LoadCurrentSaveFile
// [0x00020400] 
struct UOLEngine_execLoadCurrentSaveFile_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.RefreshSaveFiles
// [0x00020400] 
struct UOLEngine_execRefreshSaveFiles_Params
{
};

// Function OLGame.OLEngine.DeleteSaveFile
// [0x00020400] 
struct UOLEngine_execDeleteSaveFile_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLEngine.LoadSaveFile
// [0x00020400] 
struct UOLEngine_execLoadSaveFile_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.DebugLoadGame
// [0x00020400] 
struct UOLEngine_execDebugLoadGame_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLEngine.DebugSaveGame
// [0x00020400] 
struct UOLEngine_execDebugSaveGame_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLEngine.HasValidSaveGame
// [0x00020400] 
struct UOLEngine_execHasValidSaveGame_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.SaveAllCheckpoints
// [0x00020400] 
struct UOLEngine_execSaveAllCheckpoints_Params
{
};

// Function OLGame.OLEngine.SaveCheckpointImmediate
// [0x00020400] 
struct UOLEngine_execSaveCheckpointImmediate_Params
{
	struct FName                                       CheckpointName;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLEngine.SaveCheckpoint
// [0x00020400] 
struct UOLEngine_execSaveCheckpoint_Params
{
	struct FName                                       CheckpointName;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bSaveToDisk : 1;                                  		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLEngine.StartCurrentCheckpoint
// [0x00020400] 
struct UOLEngine_execStartCurrentCheckpoint_Params
{
};

// Function OLGame.OLEngine.SelectAndLoadGame
// [0x00020002] 
struct UOLEngine_execSelectAndLoadGame_Params
{
	struct FScriptDelegate                             Callback;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLEngine.NativeSelectAndLoadGame
// [0x00020400] 
struct UOLEngine_execNativeSelectAndLoadGame_Params
{
};

// Function OLGame.OLEngine.SelectSaveLocation
// [0x00020002] 
struct UOLEngine_execSelectSaveLocation_Params
{
	class FString                                      startCP;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FScriptDelegate                             Callback;                                         		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLEngine.NativeSelectSaveLocation
// [0x00020400] 
struct UOLEngine_execNativeSelectSaveLocation_Params
{
	class FString                                      startCP;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLEngine.FinishedSaveDataDialog
// [0x00020802] 
struct UOLEngine_eventFinishedSaveDataDialog_Params
{
	uint32_t                                           bSuccess : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLEngine.SaveDataDialogDoneCallback
// [0x00120000] 
struct UOLEngine_execSaveDataDialogDoneCallback_Params
{
	uint32_t                                           bSuccess : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLEngine.UsingFixedSaveLocation
// [0x00020400] 
struct UOLEngine_execUsingFixedSaveLocation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.TryStartDLCGame
// [0x00020400] 
struct UOLEngine_execTryStartDLCGame_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.ShouldShowNewDLCGame
// [0x00020400] 
struct UOLEngine_execShouldShowNewDLCGame_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.RefreshDLC
// [0x00020400] 
struct UOLEngine_execRefreshDLC_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.CheckReloadForDLC
// [0x00020400] 
struct UOLEngine_execCheckReloadForDLC_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLEngine.RestartPlayer
// [0x00020802] 
struct UOLEngine_eventRestartPlayer_Params
{
	class AOLPlayerController*                         OLPC;                                             		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AWorldInfo*                                  WI;                                               		// 0x0008 (0x0008) [0x0000000000000000]               
	// class AOLGame*                                     CurrentGame;                                      		// 0x0010 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLFloorMaterialVolume.OnToggle
// [0x00020102] 
struct AOLFloorMaterialVolume_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLFXManager.SetFXForEnemyPawn
// [0x00020400] 
struct UOLFXManager_execSetFXForEnemyPawn_Params
{
	class AOLEnemyPawn*                                EnemyPawn;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLFXManager.DeactivateNightVisionEffect
// [0x00020400] 
struct UOLFXManager_execDeactivateNightVisionEffect_Params
{
};

// Function OLGame.OLFXManager.ActivateCamcorderEffect
// [0x00020400] 
struct UOLFXManager_execActivateCamcorderEffect_Params
{
};

// Function OLGame.OLFXManager.ActivateNightVisionEffect
// [0x00020400] 
struct UOLFXManager_execActivateNightVisionEffect_Params
{
	uint32_t                                           bPowered : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLFXManager.SetPPSFromScript
// [0x00020400] 
struct UOLFXManager_execSetPPSFromScript_Params
{
	uint8_t                                            newPPS;                                           		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLFXManager.GetFXManager
// [0x00022400] 
struct UOLFXManager_execGetFXManager_Params
{
	class UOLFXManager*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLGame.ClearPause
// [0x00020802] 
struct AOLGame_eventClearPause_Params
{
};

// Function OLGame.OLGame.SetPause
// [0x00024002] 
struct AOLGame_execSetPause_Params
{
