/*
#############################################################################################
# Outlast (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: OLGame_classes.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/


/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum OLGame.OLPawn.ESpecialMoveType
enum class ESpecialMoveType : uint8_t
{
	SMT_None                                           = 0,
	SMT_Crouch                                         = 1,
	SMT_Uncrouch                                       = 2,
	SMT_JumpOnSpot                                     = 3,
	SMT_BigLanding                                     = 4,
	SMT_JumpOver                                       = 5,
	SMT_JumpOverAndGrabLedge                           = 6,
	SMT_SlideOver                                      = 7,
	SMT_ClimbUpObstacle                                = 8,
	SMT_ClimbUpWall                                    = 9,
	SMT_ClimbOverWall                                  = 10,
	SMT_StepUpAndLand                                  = 11,
	SMT_EnterLookBack                                  = 12,
	SMT_ExitLookBack                                   = 13,
	SMT_GrabLedgeFromGround                            = 14,
	SMT_GrabLedgeFromAir                               = 15,
	SMT_LedgeHangTransition                            = 16,
	SMT_ClimbUpLedge                                   = 17,
	SMT_DropFromLedge                                  = 18,
	SMT_GrabAndClimb                                   = 19,
	SMT_EnterLedgeWalk                                 = 20,
	SMT_ExitLedgeWalk                                  = 21,
	SMT_LedgeWalkTransition                            = 22,
	SMT_JumpFromLedgeWalk                              = 23,
	SMT_EnterSqueeze                                   = 24,
	SMT_ExitSqueeze                                    = 25,
	SMT_AutomaticSqueeze                               = 26,
	SMT_SqueezeReload                                  = 27,
	SMT_EnterDoorInteraction                           = 28,
	SMT_OpenDoorInstant                                = 29,
	SMT_OpenDoorPartial                                = 30,
	SMT_TryOpenLockedDoor                              = 31,
	SMT_RunThroughDoor                                 = 32,
	SMT_CloseDoor                                      = 33,
	SMT_CloseDoorPositionned                           = 34,
	SMT_ClearClosingDoor                               = 35,
	SMT_DoorClosedFromOtherSide                        = 36,
	SMT_OpenLockerFromOutside                          = 37,
	SMT_EnterLocker                                    = 38,
	SMT_ExitLocker                                     = 39,
	SMT_EnterBed                                       = 40,
	SMT_ExitBed                                        = 41,
	SMT_BedReload                                      = 42,
	SMT_EnterLadderFromGround                          = 43,
	SMT_EnterLadderFromAbove                           = 44,
	SMT_ExitLadderOnGround                             = 45,
	SMT_ExitLadderOnTop                                = 46,
	SMT_DropFromLadder                                 = 47,
	SMT_GrabLadderFromAir                              = 48,
	SMT_PickupObject                                   = 49,
	SMT_CSA                                            = 50,
	SMT_EnterStruggle                                  = 51,
	SMT_ExitStruggle                                   = 52,
	SMT_KilledInStruggle                               = 53,
	SMT_StartPushingObject                             = 54,
	SMT_StopPushingObject                              = 55,
	SMT_PushFromLedgeProcedural                        = 56,
	SMT_PushFromLedgeAnimated                          = 57,
	SMT_EnterContextualLean                            = 58,
	SMT_ExitContextualLean                             = 59,
	SMT_ExitContextualLeanForward                      = 60,
	SMT_ContextualLeanInsideTransition                 = 61,
	SMT_HeroGrabbedNormal                              = 62,
	SMT_HeroGrabbedFromSqueeze                         = 63,
	SMT_HeroGrabbedFromLocker                          = 64,
	SMT_HeroGrabbedFromBed                             = 65,
	SMT_HeroGrabbedFromUnder                           = 66,
	SMT_HeroThrown                                     = 67,
	SMT_HeroDecapitate                                 = 68,
	SMT_HeroKilled                                     = 69,
	SMT_Dying                                          = 70,
	SMT_AttackNormal                                   = 71,
	SMT_AttackGrab                                     = 72,
	SMT_AttackLocker                                   = 73,
	SMT_AttackBed                                      = 74,
	SMT_AttackGrabUnder                                = 75,
	SMT_AttackCrouch                                   = 76,
	SMT_AttackQuick                                    = 77,
	SMT_AttackPush                                     = 78,
	SMT_AttackSqueezeStart                             = 79,
	SMT_AttackSqueezeStartToWait                       = 80,
	SMT_AttackSqueezeWaitToFail                        = 81,
	SMT_AttackSqueezeWaitToSuccess                     = 82,
	SMT_AttackSqueezeSuccess                           = 83,
	SMT_ThrowHero                                      = 84,
	SMT_KillHero                                       = 85,
	SMT_InvestigateLocker                              = 86,
	SMT_InvestigateBed                                 = 87,
	SMT_Bash                                           = 88,
	SMT_BashDoorStart                                  = 89,
	SMT_BashDoorLoop                                   = 90,
	SMT_BashDoorFinish                                 = 91,
	SMT_BashDoorFailed                                 = 92,
	SMT_Avoiding                                       = 93,
	SMT_Knockedback                                    = 94,
	SMT_TurnOnSpot                                     = 95,
	SMT_AIVault                                        = 96,
	SMT_NanoThroughDoor                                = 97,
	SMT_Disturbed                                      = 98,
	SMT_AlignAnim                                      = 99,
	SMT_SlideToNavMesh                                 = 100,
	SMTTT_FixCompileErrorWithSteam_SMT_END             = 101,
	ESpecialMoveType_END                               = 102
};

// Enum OLGame.OLPawn.ELocomotionMode
enum class ELocomotionMode : uint8_t
{
	LM_Walk                                            = 0,
	LM_Fall                                            = 1,
	LM_SpecialMove                                     = 2,
	LM_Ladder                                          = 3,
	LM_LedgeHang                                       = 4,
	LM_LedgeWalk                                       = 5,
	LM_Squeeze                                         = 6,
	LM_Door                                            = 7,
	LM_Locker                                          = 8,
	LM_Cinematic                                       = 9,
	LM_Bed                                             = 10,
	LM_LookBack                                        = 11,
	LM_Struggle                                        = 12,
	LM_Grabbed                                         = 13,
	LM_Pushing                                         = 14,
	LM_ContextualLean                                  = 15,
	LM_END                                             = 16
};

// Enum OLGame.OLPawn.EAdjustPositionTargetType
enum class EAdjustPositionTargetType : uint8_t
{
	APTT_TargetAtStart                                 = 0,
	APTT_TargetAtEnd                                   = 1,
	APTT_END                                           = 2
};

// Enum OLGame.OLPawn.CameraRotationMode
enum class ECameraRotationMode : uint8_t
{
	CRM_UserControlled                                 = 0,
	CRM_Limited                                        = 1,
	CRM_Spring                                         = 2,
	CRM_FullyAnimated                                  = 3,
	CRM_Locked                                         = 4,
	CRM_END                                            = 5
};

// Enum OLGame.OLAIContextualVOAsset.EVOContext
enum class EVOContext : uint8_t
{
	EVOC_Undefined                                     = 0,
	EVOC_LostTarget                                    = 1,
	EVOC_PatrolToInvestigate                           = 2,
	EVOC_SwitchToChase                                 = 3,
	EVOC_SwitchToChaseMultiple                         = 4,
	EVOC_ChaseToInvestigate                            = 5,
	EVOC_Spawned                                       = 6,
	EVOC_END                                           = 7
};

// Enum OLGame.OLEnemyPawn.ERotationMode
enum class ERotationMode : uint8_t
{
	RM_FaceVelocity                                    = 0,
	RM_FaceTarget                                      = 1,
	RM_Explicit                                        = 2,
	RM_END                                             = 3
};

// Enum OLGame.OLEnemyPawn.EEnemyMode
enum class EEnemyMode : uint8_t
{
	EM_Patrol                                          = 0,
	EM_Investigate                                     = 1,
	EM_Chase                                           = 2,
	EM_SqueezeGrabLeft                                 = 3,
	EM_SqueezeGrabRight                                = 4,
	EM_END                                             = 5
};

// Enum OLGame.OLEnemyPawn.EAttackSide
enum class EAttackSide : uint8_t
{
	EAS_Left                                           = 0,
	EAS_Right                                          = 1,
	EAS_Middle                                         = 2,
	EAS_END                                            = 3
};

// Enum OLGame.OLEnemyPawn.EMoveSpeedMode
enum class EMoveSpeedMode : uint8_t
{
	EMSM_Default                                       = 0,
	EMSM_Override                                      = 1,
	EMSM_RubberBanding                                 = 2,
	EMSM_END                                           = 3
};

// Enum OLGame.OLEnemyPawn.EWeapon
enum class EWeapon : uint8_t
{
	Weapon_None                                        = 0,
	Weapon_Knife                                       = 1,
	Weapon_ButcherKnife                                = 2,
	Weapon_BoneShear                                   = 3,
	Weapon_Machete                                     = 4,
	Weapon_NightStick                                  = 5,
	Weapon_Pipe                                        = 6,
	Weapon_WoodPlank                                   = 7,
	Weapon_CannibalDrill                               = 8,
	Weapon_END                                         = 9
};

// Enum OLGame.OLEnemyPawn.EWeaponType
enum class EWeaponType : uint8_t
{
	WeaponType_None                                    = 0,
	WeaponType_Blunt                                   = 1,
	WeaponType_Stab                                    = 2,
	WeaponType_END                                     = 3
};

// Enum OLGame.OLAnimEnemyStruggle.EStruggleAnimPhase
enum class EStruggleAnimPhase : uint8_t
{
	SAP_StartIdle                                      = 0,
	SAP_Entry                                          = 1,
	SAP_Cycle                                          = 2,
	SAP_Success                                        = 3,
	SAP_Fail                                           = 4,
	SAP_SuccessIdle                                    = 5,
	SAP_END                                            = 6
};

// Enum OLGame.OLAnimNotify_Door.EDoorInteraction
enum class EDoorInteraction : uint8_t
{
	DI_Open                                            = 0,
	DI_Close                                           = 1,
	DI_END                                             = 2
};

// Enum OLGame.OLHero.NVGlitchType
enum class ENVGlitchType : uint8_t
{
	NVGT_SuddenDrop                                    = 0,
	NVGT_SlowDrop                                      = 1,
	NVGT_Buzz                                          = 2,
	NVGT_LastBreath                                    = 3,
	NVGT_END                                           = 4
};

// Enum OLGame.OLHero.ECamcorderState
enum class ECamcorderState : uint8_t
{
	CCS_Inactive                                       = 0,
	CCS_Active                                         = 1,
	CCS_Raising                                        = 2,
	CCS_Lowering                                       = 3,
	CCS_ReloadingActive                                = 4,
	CCS_ReloadingInactive                              = 5,
	CCS_END                                            = 6
};

// Enum OLGame.OLHero.ELedgeTransitionType
enum class ELedgeTransitionType : uint8_t
{
	LTT_LeftInside                                     = 0,
	LTT_LeftOutside                                    = 1,
	LTT_RightInside                                    = 2,
	LTT_RightOutside                                   = 3,
	LTT_END                                            = 4
};

// Enum OLGame.OLHero.ELedgeClimbType
enum class ELedgeClimbType : uint8_t
{
	LCT_ClimbUpToStand                                 = 0,
	LCT_ClimbUpToCrouch                                = 1,
	LCT_ClimbOverToFalling                             = 2,
	LCT_ClimbOverToStand                               = 3,
	LCT_END                                            = 4
};

// Enum OLGame.OLHero.ESqueezeTransitionType
enum class ESqueezeTransitionType : uint8_t
{
	STT_Left_Facing                                    = 0,
	STT_Left_Back                                      = 1,
	STT_Right_Facing                                   = 2,
	STT_Right_Back                                     = 3,
	STT_END                                            = 4
};

// Enum OLGame.OLHero.EDoorOpeningType
enum class EDoorOpeningType : uint8_t
{
	DOT_LeftPush                                       = 0,
	DOT_LeftPull                                       = 1,
	DOT_RightPush                                      = 2,
	DOT_RightPull                                      = 3,
	DOT_END                                            = 4
};

// Enum OLGame.OLHero.EDoorPartialOpenType
enum class EDoorPartialOpenType : uint8_t
{
	DPOT_LeftPush                                      = 0,
	DPOT_LeftPull                                      = 1,
	DPOT_LeftSwipe                                     = 2,
	DPOT_RightPush                                     = 3,
	DPOT_RightPull                                     = 4,
	DPOT_RightSwipe                                    = 5,
	DPOT_END                                           = 6
};

// Enum OLGame.OLHero.EDoorClosingType
enum class EDoorClosingType : uint8_t
{
	DCT_LeftFront                                      = 0,
	DCT_LeftSide                                       = 1,
	DCT_LeftBack                                       = 2,
	DCT_LeftInside                                     = 3,
	DCT_RightFront                                     = 4,
	DCT_RightSide                                      = 5,
	DCT_RightBack                                      = 6,
	DCT_RightInside                                    = 7,
	DCT_END                                            = 8
};

// Enum OLGame.OLHero.EEnemyType
enum class EEnemyType : uint8_t
{
	ET_Soldier                                         = 0,
	ET_Generic                                         = 1,
	ET_Surgeon                                         = 2,
	ET_Swarm                                           = 3,
	ET_Other                                           = 4,
	ET_Groom                                           = 5,
	ET_Cannibal                                        = 6,
	ET_END                                             = 7
};

// Enum OLGame.OLHero.EHeroBodySetup
enum class EHeroBodySetup : uint8_t
{
	HBS_Normal                                         = 0,
	HBS_NoProxy                                        = 1,
	HBS_CamcorderRaised                                = 2,
	HBS_CamcorderRaisedNoShadow                        = 3,
	HBS_CamcorderVisible                               = 4,
	HBS_END                                            = 5
};

// Enum OLGame.OLHero.ECamcorderMode
enum class ECamcorderMode : uint8_t
{
	CCM_Default                                        = 0,
	CCM_PoweredNightVision                             = 1,
	CCM_NightVision                                    = 2,
	CCM_END                                            = 3
};

// Enum OLGame.OLHero.CornerPeekPosition
enum class ECornerPeekPosition : uint8_t
{
	CPP_Left                                           = 0,
	CPP_Right                                          = 1,
	CPP_MiddleLeft                                     = 2,
	CPP_MiddleRight                                    = 3,
	CPP_END                                            = 4
};

// Enum OLGame.OLHero.IKTargetType
enum class EIKTargetType : uint8_t
{
	IKTT_DoorKnob                                      = 0,
	IKTT_CSAPropDestination                            = 1,
	IKTT_Other                                         = 2,
	IKTT_END                                           = 3
};

// Enum OLGame.OLBashableObject.EOLBashableType
enum class EOLBashableType : uint8_t
{
	EOLBT_Wall                                         = 0,
	EOLBT_Table                                        = 1,
	EOLBT_END                                          = 2
};

// Enum OLGame.OLBot.AIAttackType
enum class EAIAttackType : uint8_t
{
	AT_Normal                                          = 0,
	AT_Squeeze                                         = 1,
	AT_Locker                                          = 2,
	AT_Bed                                             = 3,
	AT_Grab                                            = 4,
	AT_GrabCrouch                                      = 5,
	AT_GrabUnder                                       = 6,
	AT_Push                                            = 7,
	AT_END                                             = 8
};

// Enum OLGame.OLBot.EMoveFailedReason
enum class EMoveFailedReason : uint8_t
{
	MFR_Unknown                                        = 0,
	MFR_AINotOnNavMesh                                 = 1,
	MFR_TargetNotOnNavMesh                             = 2,
	MFR_NoPathToTarget                                 = 3,
	MFR_Aborted                                        = 4,
	MFR_END                                            = 5
};

// Enum OLGame.OLBot.EMoveType
enum class EMoveType : uint8_t
{
	MT_Invalid                                         = 0,
	MT_Point                                           = 1,
	MT_Actor                                           = 2,
	MT_END                                             = 3
};

// Enum OLGame.OLBot.EMoveStatus
enum class EMoveStatus : uint8_t
{
	MS_Moving                                          = 0,
	MS_Success                                         = 1,
	MS_Failed                                          = 2,
	MS_Pending                                         = 3,
	MS_END                                             = 4
};

// Enum OLGame.OLBot.EOLInvestigationPointType
enum class EOLInvestigationPointType : uint8_t
{
	OLIPT_Normal                                       = 0,
	OLIPT_Locker                                       = 1,
	OLIPT_Bed                                          = 2,
	OLIPT_END                                          = 3
};

// Enum OLGame.OLBot.EAIEnvironment
enum class EAIEnvironment : uint8_t
{
	AIE_Normal                                         = 0,
	AIE_Darkness                                       = 1,
	AIE_Electricity                                    = 2,
	AIE_END                                            = 3
};

// Enum OLGame.OLBot.EAIBehaviorState
enum class EAIBehaviorState : uint8_t
{
	AIBS_Idle                                          = 0,
	AIBS_Patrolling                                    = 1,
	AIBS_Investigating                                 = 2,
	AIBS_Chasing                                       = 3,
	AIBS_END                                           = 4
};

// Enum OLGame.OLBTBehavior.EStatus
enum class EStatus : uint8_t
{
	Status_Invalid                                     = 0,
	Status_Success                                     = 1,
	Status_Failure                                     = 2,
	Status_Running                                     = 3,
	Status_ReachedCurrent                              = 4,
	Status_END                                         = 5
};

// Enum OLGame.OLBTDistanceToPlayerNode.EBTComparison
enum class EBTComparison : uint8_t
{
	BTC_LessThan                                       = 0,
	BTC_LessThanOrEqual                                = 1,
	BTC_GreaterThan                                    = 2,
	BTC_GreaterThanOrEqual                             = 3,
	BTC_END                                            = 4
};

// Enum OLGame.OLBTWaitHandlerNode.EWaitHandlerState
enum class EWaitHandlerState : uint8_t
{
	EWHS_Active                                        = 0,
	EWHS_Waiting                                       = 1,
	EWHS_END                                           = 2
};

// Enum OLGame.OLCheatManager.EDebugTrajectoryType
enum class EDebugTrajectoryType : uint8_t
{
	DTT_Walking                                        = 0,
	DTT_Falling                                        = 1,
	DTT_AdjustPosition                                 = 2,
	DTT_ProceduralAnim                                 = 3,
	DTT_SpecialMove                                    = 4,
	DTT_Camera                                         = 5,
	DTT_Other                                          = 6,
	DTT_END                                            = 7
};

// Enum OLGame.OLCheckpointList.OutlastGameType
enum class EOutlastGameType : uint8_t
{
	OGT_Outlast                                        = 0,
	OGT_Whistleblower                                  = 1,
	OGT_END                                            = 2
};

// Enum OLGame.OLDoor.DoorEventType
enum class EDoorEventType : uint8_t
{
	DET_StartOpening                                   = 0,
	DET_Opened                                         = 1,
	DET_Closed                                         = 2,
	DET_TriedOnLocked                                  = 3,
	DET_OpenThresholdReached                           = 4,
	DET_Bashed                                         = 5,
	DET_StartedBashing                                 = 6,
	DET_StartedClosing                                 = 7,
	DET_END                                            = 8
};

// Enum OLGame.OLDoor.EDoorState
enum class EDoorState : uint8_t
{
	DS_Idle                                            = 0,
	DS_Opening                                         = 1,
	DS_Closing                                         = 2,
	DS_PlayerInteracting                               = 3,
	DS_Animating                                       = 4,
	DS_END                                             = 5
};

// Enum OLGame.OLDoor.EDoorBreakState
enum class EDoorBreakState : uint8_t
{
	DBS_Normal                                         = 0,
	DBS_Breaking                                       = 1,
	DBS_Broken                                         = 2,
	DBS_END                                            = 3
};

// Enum OLGame.OLDoor.ECancelBashDirection
enum class ECancelBashDirection : uint8_t
{
	ECBD_Both                                          = 0,
	ECBD_Forward                                       = 1,
	ECBD_Backward                                      = 2,
	ECBD_END                                           = 3
};

// Enum OLGame.OLDoor.EOLDoorMeshType
enum class EOLDoorMeshType : uint8_t
{
	DMesh_Undefined                                    = 0,
	DMesh_Wooden                                       = 1,
	DMesh_WoodenOld                                    = 2,
	DMesh_WoodenWindow                                 = 3,
	DMesh_WoodenWindowSmall                            = 4,
	DMesh_WoodenWindowOld                              = 5,
	DMesh_WoodenWindowOldSmall                         = 6,
	DMesh_WoodenWindowBig                              = 7,
	DMesh_Metal                                        = 8,
	DMesh_MetalWindow                                  = 9,
	DMesh_MetalWindowSmall                             = 10,
	DMesh_Enforced                                     = 11,
	DMesh_Grid                                         = 12,
	DMesh_Prison                                       = 13,
	DMesh_Entrance                                     = 14,
	DMesh_Bathroom                                     = 15,
	DMesh_IsolatedCell                                 = 16,
	DMesh_Locker                                       = 17,
	DMesh_LockerRusted                                 = 18,
	DMesh_LockerBeige                                  = 19,
	DMesh_LockerGreen                                  = 20,
	DMesh_Glass                                        = 21,
	DMesh_Fence                                        = 22,
	DMesh_LockerHole                                   = 23,
	DMesh_END                                          = 24
};

// Enum OLGame.OLDoor.EDoorMaterial
enum class EDoorMaterial : uint8_t
{
	OLDM_Wood                                          = 0,
	OLDM_Metal                                         = 1,
	OLDM_SecurityDoor                                  = 2,
	OLDM_BigPrisonDoor                                 = 3,
	OLDM_BigWoodenDoor                                 = 4,
	OLDM_END                                           = 5
};

// Enum OLGame.OLDoor.EOLDoorType
enum class EOLDoorType : uint8_t
{
	DT_Normal                                          = 0,
	DT_Locker                                          = 1,
	DT_END                                             = 2
};

// Enum OLGame.OLEnemyNanoCloud.NanoCloudForm
enum class ENanoCloudForm : uint8_t
{
	NCF_Swarm                                          = 0,
	NCF_Human                                          = 1,
	NCF_MorphingToSwarm                                = 2,
	NCF_MorphingToHuman                                = 3,
	NCF_END                                            = 4
};

// Enum OLGame.OLEnemyNanoCloud.MorphingValueType
enum class EMorphingValueType : uint8_t
{
	MVT_CloudEmitter                                   = 0,
	MVT_SmallEmitters                                  = 1,
	MVT_SwarmMaterial                                  = 2,
	MVT_SkeletonMaterial                               = 3,
	MVT_EyesMaterial                                   = 4,
	MVT_END                                            = 5
};

// Enum OLGame.OLEngine.OrbisDialogType
enum class EOrbisDialogType : uint8_t
{
	ODT_None                                           = 0,
	ODT_SelectSaveLocation                             = 1,
	ODT_LoadGame                                       = 2,
	ODT_SystemError                                    = 3,
	ODT_LoadedBadCheckpoint                            = 4,
	ODT_PSStore                                        = 5,
	ODT_END                                            = 6
};

// Enum OLGame.OLEngine.ECheckpointAction
enum class ECheckpointAction : uint8_t
{
	Checkpoint_Default                                 = 0,
	Checkpoint_Load                                    = 1,
	Checkpoint_SaveToDisk                              = 2,
	Checkpoint_SaveToMemory                            = 3,
	Checkpoint_END                                     = 4
};

// Enum OLGame.OLFXManager.EPPSMode
enum class EPPSMode : uint8_t
{
	PPS_Default                                        = 0,
	PPS_Camcorder                                      = 1,
	PPS_NightVision                                    = 2,
	PPS_GammaCalibration                               = 3,
	PPS_Death                                          = 4,
	PPS_END                                            = 5
};

// Enum OLGame.OLFXManager.CameraGlitchType
enum class ECameraGlitchType : uint8_t
{
	CGT_OnOff                                          = 0,
	CGT_LinearDrop                                     = 1,
	CGT_Sine                                           = 2,
	CGT_END                                            = 3
};

// Enum OLGame.OLGame.EDifficultyMode
enum class EDifficultyMode : uint8_t
{
	EDM_Normal                                         = 0,
	EDM_Hard                                           = 1,
	EDM_Nightmare                                      = 2,
	EDM_Insane                                         = 3,
	EDM_END                                            = 4
};

// Enum OLGame.OLHUD.EHUDMessageType
enum class EHUDMessageType : uint8_t
{
	EHMT_None                                          = 0,
	EHMT_Objective                                     = 1,
	EHMT_Tutorial                                      = 2,
	EHMT_Generic                                       = 3,
	EHMT_Interaction                                   = 4,
	EHMT_Subtitle                                      = 5,
	EHMT_ShakeMouse                                    = 6,
	EHMT_ShakeStick                                    = 7,
	EHMT_END                                           = 8
};

// Enum OLGame.OLHUD.EMenuType
enum class EMenuType : uint8_t
{
	EMT_MainMenu                                       = 0,
	EMT_PauseMenu                                      = 1,
	EMT_TabMenu                                        = 2,
	EMT_RecordingMenu                                  = 3,
	EMT_EvidenceMenu                                   = 4,
	EMT_Credits                                        = 5,
	EMT_END                                            = 6
};

// Enum OLGame.OLInterpTrackPPSEffectParam.TrackPropertyType
enum class ETrackPropertyType : uint8_t
{
	TPP_MaterialInstance                               = 0,
	TPP_UberMovieIntensity                             = 1,
	TPP_END                                            = 2
};

// Enum OLGame.OLPlayerController.EOutlastAchievement
enum class EOutlastAchievement : uint8_t
{
	OA_000_StartedGenerator                            = 0,
	OA_001_DrainedSewer                                = 1,
	OA_002_StartedSprinklers                           = 2,
	OA_003_FoundFemaleWardKey                          = 3,
	OA_004_MilestoneCollectibles                       = 4,
	OA_005_FinishedGame                                = 5,
	OA_006_AllCollectibles                             = 6,
	OA_007_FinishedNightmare                           = 7,
	OA_008_TurnOffGas                                  = 8,
	OA_009_TurnOffPower                                = 9,
	OA_010_FinishDLC                                   = 10,
	OA_011_FinishDLCInsane                             = 11,
	OA_012_AllDLCDocs                                  = 12,
	OA_013_AllDLCRecordings                            = 13,
	OA_END                                             = 14
};

// Enum OLGame.OLPlayerController.EAIMusicState
enum class EAIMusicState : uint8_t
{
	EAIMS_None                                         = 0,
	EAIMS_Patrol                                       = 1,
	EAIMS_Investigate                                  = 2,
	EAIMS_Chase                                        = 3,
	EAIMS_END                                          = 4
};

// Enum OLGame.OLPlayerController.StruggleInputDirection
enum class EStruggleInputDirection : uint8_t
{
	SID_Undefined                                      = 0,
	SID_Left                                           = 1,
	SID_Right                                          = 2,
	SID_END                                            = 3
};

// Enum OLGame.OLPlayerController.ZoomMovementType
enum class EZoomMovementType : uint8_t
{
	Zoom_Undefined                                     = 0,
	Zoom_MovingLeft                                    = 1,
	Zoom_NotMoving                                     = 2,
	Zoom_MovingRight                                   = 3,
	Zoom_END                                           = 4
};

// Enum OLGame.OLPlayerController.EPlayerInteractionType
enum class EPlayerInteractionType : uint8_t
{
	PIT_CSA                                            = 0,
	PIT_PickupObject                                   = 1,
	PIT_BatteriesFull                                  = 2,
	PIT_EnterBed                                       = 3,
	PIT_EnterLocker                                    = 4,
	PIT_ExitLocker                                     = 5,
	PIT_OpenDoor                                       = 6,
	PIT_OpenPartiallyOpenDoor                          = 7,
	PIT_CloseDoor                                      = 8,
	PIT_LockedDoor                                     = 9,
	PIT_AutoCloseDoor                                  = 10,
	PIT_ClimbUpLedge                                   = 11,
	PIT_ReloadBatteries                                = 12,
	PIT_Struggle                                       = 13,
	PIT_PushObject                                     = 14,
	PIT_END                                            = 15
};

// Enum OLGame.OLPlayerInput.GamepadBindingsType
enum class EGamepadBindingsType : uint8_t
{
	GBT_A                                              = 0,
	GBT_B                                              = 1,
	GBT_C                                              = 2,
	GBT_END                                            = 3
};

// Enum OLGame.OLProfileSettings.ProfileQualityLevel
enum class EProfileQualityLevel : uint8_t
{
	PQL_VeryLow                                        = 0,
	PQL_Low                                            = 1,
	PQL_Medium                                         = 2,
	PQL_High                                           = 3,
	PQL_VeryHigh                                       = 4,
	PQL_Custom                                         = 5,
	PQL_END                                            = 6
};

// Enum OLGame.OLProfileSettings.EScreenResolution
enum class EScreenResolution : uint8_t
{
	SR_800x600                                         = 0,
	SR_1024x768                                        = 1,
	SR_1280x720                                        = 2,
	SR_1280x800                                        = 3,
	SR_1280x960                                        = 4,
	SR_1366x768                                        = 5,
	SR_1600x900                                        = 6,
	SR_1600x1200                                       = 7,
	SR_1680x1050                                       = 8,
	SR_1920x1080                                       = 9,
	SR_1920x1200                                       = 10,
	SR_1920x1440                                       = 11,
	SR_2560x1440                                       = 12,
	SR_2560x1600                                       = 13,
	SR_Other                                           = 14,
	SR_END                                             = 15
};

// Enum OLGame.OLProfileSettings.EGamepadConfigId
enum class EGamepadConfigId : uint8_t
{
	GC_TypeA                                           = 0,
	GC_TypeB                                           = 1,
	GC_TypeC                                           = 2,
	GC_END                                             = 3
};

// Enum OLGame.OLProfileSettings.ELanguage
enum class ELanguage : uint8_t
{
	EL_English                                         = 0,
	EL_French                                          = 1,
	EL_Spanish                                         = 2,
	EL_Italian                                         = 3,
	EL_German                                          = 4,
	EL_Russian                                         = 5,
	EL_Polish                                          = 6,
	EL_Brazilian                                       = 7,
	EL_Japanese                                        = 8,
	EL_END                                             = 9
};

// Enum OLGame.OLPushableObject.PushableMaterial
enum class EPushableMaterial : uint8_t
{
	PM_Wood                                            = 0,
	PM_Metal                                           = 1,
	PM_END                                             = 2
};

// Enum OLGame.OLPushableObject.PushableEventType
enum class EPushableEventType : uint8_t
{
	PET_StartedPushing                                 = 0,
	PET_StoppedPushing                                 = 1,
	PET_UnblockedDoor                                  = 2,
	PET_BlockedDoor                                    = 3,
	PET_END                                            = 4
};

// Enum OLGame.OLSeqAct_Limp.EHobbleIntensity
enum class EHobbleIntensity : uint8_t
{
	HI_VeryBad                                         = 0,
	HI_Bad                                             = 1,
	HI_NotSoBad                                        = 2,
	HI_RatherOk                                        = 3,
	HI_Healed                                          = 4,
	HI_END                                             = 5
};

// Enum OLGame.OLSeqAct_MovieEffect.MovieEffectAnim
enum class EMovieEffectAnim : uint8_t
{
	MEA_Random                                         = 0,
	MEA_Anim1                                          = 1,
	MEA_Anim2                                          = 2,
	MEA_Anim3                                          = 3,
	MEA_END                                            = 4
};

// Enum OLGame.OLSeqEvent_NightVision.ENVEvent
enum class ENVEvent : uint8_t
{
	NVE_CamcorderActivated                             = 0,
	NVE_CamcorderDeactivated                           = 1,
	NVE_DefaultViewSelected                            = 2,
	NVE_PassiveNVSelected                              = 3,
	NVE_ActiveNVSelected                               = 4,
	NVE_OutOfBatteries                                 = 5,
	NVE_END                                            = 6
};

// Enum OLGame.OLUberPostProcessEffect.ECameraMode
enum class ECameraMode : uint8_t
{
	CM_Off                                             = 0,
	CM_On                                              = 1,
	CM_OnNightVision                                   = 2,
	CM_END                                             = 3
};

// Enum OLGame.OLUIFrontEnd_Options.ENonProfileOption
enum class ENonProfileOption : uint8_t
{
	NPO_None                                           = 0,
	NPO_DisableMotionBlur                              = 1,
	NPO_Difficulty                                     = 2,
	NPO_END                                            = 3
};

// Enum OLGame.OLUIFrontEnd_Options.EOptionSelectorType
enum class EOptionSelectorType : uint8_t
{
	OST_CheckBox                                       = 0,
	OST_Dropdown                                       = 1,
	OST_Slider                                         = 2,
	OST_KeyBinding                                     = 3,
	OST_ControllerConfigButton                         = 4,
	OST_GammaButton                                    = 5,
	OST_END                                            = 6
};

// Enum OLGame.OLUIFrontEnd_Options.EOptionTabs
enum class EOptionTabs : uint8_t
{
	OT_Gameplay                                        = 0,
	OT_Graphics                                        = 1,
	OT_Controls                                        = 2,
	OT_END                                             = 3
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class OLGame.ActorFactoryOLAmbientSound
// 0x0000 OR 0x00A4 (0x00A4 - 0x00A4)
// 0 OR 164 (164 - 164)
class UActorFactoryOLAmbientSound : public UActorFactoryAkAmbientSound
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class OLGame.ActorFactoryOLAmbientSound");
		}

		return uClassPointer;
	};

};

// Class OLGame.ActorFactoryOLSoundEmittingMeshActor
// 0x0010 OR 0x00C0 (0x00C0 - 0x00B0)
// 16 OR 192 (192 - 176)
class UActorFactoryOLSoundEmittingMeshActor : public UActorFactoryStaticMesh
{
public:
	class UAkEvent*                                    StartEvent;                                    // 0x00B0 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UAkEvent*                                    StopEvent;                                     // 0x00B8 (0x0008) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class OLGame.ActorFactoryOLSoundEmittingMeshActor");
		}

		return uClassPointer;
	};

};

// Class OLGame.OLAmbientSound
// 0x0014 OR 0x0268 (0x0268 - 0x0254)
// 20 OR 616 (616 - 596)
class AOLAmbientSound : public AAkAmbientSound
{
public:
	uint32_t                                           bAllowVirtualization : 1;                      // 0x0254 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	TArray<class AOLAmbientSoundClone*>                Clones;                                        // 0x0258 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class OLGame.OLAmbientSound");
		}

		return uClassPointer;
	};

};

// Class OLGame.OLAmbientSoundClone
// 0x0014 OR 0x0254 (0x0254 - 0x0240)
// 20 OR 596 (596 - 576)
class AOLAmbientSoundClone : public AActor
{
public:
	class USpriteComponent*                            SpriteComp;                                    // 0x0240 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class AOLAmbientSound*                             Master;                                        // 0x0248 (0x0008) [0x0000000000020001] (CPF_Edit | CPF_EditConst)
	uint32_t                                           bAllowVirtualization : 1;                      // 0x0250 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class OLGame.OLAmbientSoundClone");
		}

		return uClassPointer;
	};

};

// Class OLGame.OLBashableObject
// 0x0058 OR 0x0298 (0x0298 - 0x0240)
// 88 OR 664 (664 - 576)
class AOLBashableObject : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObject;          // 0x0240 (0x0008) [0x0000000000801002] (CPF_Const | CPF_Native | CPF_NoExport)
	EOLBashableType                                    BashableType;                                  // 0x0248 (0x0001) [0x0000000000000001] (CPF_Edit)    
	class UStaticMeshComponent*                        PreBashCollision;                              // 0x024C (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UStaticMeshComponent*                        PostBashCollision;                             // 0x0254 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	class USkeletalMeshComponent*                      Mesh;                                          // 0x025C (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                              // 0x0264 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	struct FName                                       BashAnimation;                                 // 0x026C (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              PathPointOffset;                               // 0x0274 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BashYOffset;                                   // 0x0278 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bEnabled : 1;                                  // 0x027C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bBroken : 1;                                   // 0x027C (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bInitiallyEnabled : 1;                         // 0x027C (0x0004) [0x0000000000002000] [0x00000004] (CPF_Transient)
	struct FVector                                     Edge0Dest;                                     // 0x0280 (0x000C) [0x0000000000000000]               
	struct FVector                                     Edge1Dest;                                     // 0x028C (0x000C) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class OLGame.OLBashableObject");
		}

		return uClassPointer;
	};

	void OnToggle(class USeqAct_Toggle* Action);
	void ClearBreakTimer();
	void TriggerBreakTimer(float Time);
	void Break();
};

// Class OLGame.OLCamcorderHud
// 0x0060 OR 0x0244 (0x0244 - 0x01E4)
// 96 OR 580 (580 - 484)
class UOLCamcorderHud : public UGFxMoviePlayer
{
public:
	class AOLHUD*                                      HUD;                                           // 0x01E4 (0x0008) [0x0000000000000000]               
	uint32_t                                           bVisible : 1;                                  // 0x01EC (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              RecordingTimeSeconds;                          // 0x01F0 (0x0004) [0x0000000000000000]               
	struct FCamcorderHudObjects                        Objects;                                       // 0x01F4 (0x0038) [0x0000000000002000] (CPF_Transient)
	struct FCamcorderHudState                          HudState;                                      // 0x022C (0x0018) [0x0000000000002000] (CPF_Transient)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class OLGame.OLCamcorderHud");
		}

		return uClassPointer;
	};

	void UpdateRecordingTime(float DeltaTime);
	bool eventWidgetInitialized(struct FName WidgetName, struct FName WidgetPath, class UGFxObject* Widget);
	void eventSetVisible(bool bShow);
};

// Class OLGame.OLCameraActor
// 0x0000 OR 0x03C8 (0x03C8 - 0x03C8)
// 0 OR 968 (968 - 968)
class AOLCameraActor : public ACameraActor
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class OLGame.OLCameraActor");
		}

		return uClassPointer;
	};

	void GetCameraView(float DeltaTime, struct FTPOV& OutPOV);
	void NativeGetCameraView(struct FTPOV& OutPOV);
};

// Class OLGame.OLPlayerController
// 0x031C OR 0x0D68 (0x0D68 - 0x0A4C)
// 796 OR 3432 (3432 - 2636)
class AOLPlayerController : public AUDKPlayerController
{
public:
	class AOLHero*                                     HeroPawn;                                      // 0x0A4C (0x0008) [0x0000000000000000]               
	class AOLHUD*                                      HUD;                                           // 0x0A54 (0x0008) [0x0000000000000000]               
	class UOLInventoryManager*                         InventoryManager;                              // 0x0A5C (0x0008) [0x0000000000000000]               
	class UOLTutorialManager*                          TutorialManager;                               // 0x0A64 (0x0008) [0x0000000000000000]               
	class UOLSoundEnvironmentManager*                  SoundEnvManager;                               // 0x0A6C (0x0008) [0x0000000000000000]               
	class UOLFXManager*                                FXManager;                                     // 0x0A74 (0x0008) [0x0000000000000000]               
	class UOLSeqAct_SplashScreen*                      ActiveSplashScreen;                            // 0x0A7C (0x0008) [0x0000000000000000]               
	uint32_t                                           bFlushingStreaming : 1;                        // 0x0A84 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bHasCamcorder : 1;                             // 0x0A84 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bBlockedOnLoading : 1;                         // 0x0A84 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bShowingKismetControlledLoadingScreen : 1;     // 0x0A84 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bShowingLoadingOverlay : 1;                    // 0x0A84 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bProfileSettingsUpdated : 1;                   // 0x0A84 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bValidDoorHold : 1;                            // 0x0A84 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           bInvalidateLeanInput : 1;                      // 0x0A84 (0x0004) [0x0000000000000000] [0x00000080] 
	uint32_t                                           bInvalidateReleasedUse : 1;                    // 0x0A84 (0x0004) [0x0000000000000000] [0x00000100] 
	uint32_t                                           bToggleCrouch : 1;                             // 0x0A84 (0x0004) [0x0000000000000000] [0x00000200] 
	uint32_t                                           bOverriddenMusic : 1;                          // 0x0A84 (0x0004) [0x0000000000000000] [0x00000400] 
	uint32_t                                           bTravellingToCheckpoint : 1;                   // 0x0A84 (0x0004) [0x0000000000000000] [0x00000800] 
	uint32_t                                           bTravelCheckPersistent : 1;                    // 0x0A84 (0x0004) [0x0000000000000000] [0x00001000] 
	uint32_t                                           bForceLevelReset : 1;                          // 0x0A84 (0x0004) [0x0000000000000000] [0x00002000] 
	uint32_t                                           bFoundBySoldierWhileHidden : 1;                // 0x0A84 (0x0004) [0x0000000000000000] [0x00004000] 
	uint32_t                                           bFoundBySurgeonWhileHidden : 1;                // 0x0A84 (0x0004) [0x0000000000000000] [0x00008000] 
	uint32_t                                           bEnableShadowOptimisation : 1;                 // 0x0A84 (0x0004) [0x0000000000004000] [0x00010000] (CPF_Config)
	uint32_t                                           bEnableLightOptimisation : 1;                  // 0x0A84 (0x0004) [0x0000000000004000] [0x00020000] (CPF_Config)
	uint32_t                                           bBehindView : 1;                               // 0x0A84 (0x0004) [0x0000000000000000] [0x00040000] 
	uint32_t                                           bDebugFixedCam : 1;                            // 0x0A84 (0x0004) [0x0000000000000000] [0x00080000] 
	uint32_t                                           bDebugFreeCam : 1;                             // 0x0A84 (0x0004) [0x0000000000000000] [0x00100000] 
	uint32_t                                           bDebugGhost : 1;                               // 0x0A84 (0x0004) [0x0000000000000000] [0x00200000] 
	uint32_t                                           bSlowDownFPS : 1;                              // 0x0A84 (0x0004) [0x0000000000000000] [0x00400000] 
	struct FName                                       CurrentObjective;                              // 0x0A88 (0x0008) [0x0000000000000000]               
	TArray<struct FName>                               CompletedObjectives;                           // 0x0A90 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            NumBatteries;                                  // 0x0AA0 (0x0004) [0x0000000000000000]               
	int32_t                                            MaxNumBatteries;                               // 0x0AA4 (0x0004) [0x0000000000000000]               
	int32_t                                            NrmMaxNumBatteries;                            // 0x0AA8 (0x0004) [0x0000000000004000] (CPF_Config)  
	int32_t                                            HardMaxNumBatteries;                           // 0x0AAC (0x0004) [0x0000000000004000] (CPF_Config)  
	int32_t                                            NightmareMaxNumBatteries;                      // 0x0AB0 (0x0004) [0x0000000000004000] (CPF_Config)  
	int32_t                                            DefaultNumBatteries;                           // 0x0AB4 (0x0004) [0x0000000000004000] (CPF_Config)  
	float                                              GameOverActivatedTimestamp;                    // 0x0AB8 (0x0004) [0x0000000000000000]               
	TArray<EPlayerInteractionType>                     AvailableInteractions;                         // 0x0ABC (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      CSAPrompt;                                     // 0x0ACC (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PickupTargetName;                              // 0x0ADC (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UOLProfileSettings*                          ProfileSettings;                               // 0x0AEC (0x0008) [0x0000000000000000]               
	struct FDigitalInputs                              Inputs;                                        // 0x0AF4 (0x0004) [0x0000000000000000]               
	uint8_t                                            bLeanInputLeft;                                // 0x0AF8 (0x0001) [0x0000000000000004] (CPF_Input)   
	uint8_t                                            bLeanInputRight;                               // 0x0AF9 (0x0001) [0x0000000000000004] (CPF_Input)   
	uint8_t                                            bRunInput;                                     // 0x0AFA (0x0001) [0x0000000000000004] (CPF_Input)   
	uint8_t                                            bUseButtonDown;                                // 0x0AFB (0x0001) [0x0000000000000004] (CPF_Input)   
	EAIMusicState                                      AIMusic;                                       // 0x0AFC (0x0001) [0x0000000000000000]               
	EAIMusicState                                      OverriddenMusicState;                          // 0x0AFD (0x0001) [0x0000000000000000]               
	float                                              PureMouseX;                                    // 0x0B00 (0x0004) [0x0000000000000004] (CPF_Input)   
	float                                              AnalogLeanInputLeft;                           // 0x0B04 (0x0004) [0x0000000000000004] (CPF_Input)   
	float                                              AnalogLeanInputRight;                          // 0x0B08 (0x0004) [0x0000000000000004] (CPF_Input)   
	int32_t                                            ZoomInput;                                     // 0x0B0C (0x0004) [0x0000000000000000]               
	float                                              UsePressedTime;                                // 0x0B10 (0x0004) [0x0000000000000000]               
	struct FVector                                     LastPlayerInputIntent;                         // 0x0B14 (0x000C) [0x0000000000000000]               
	struct FTouchZoomData                              TouchZoom;                                     // 0x0B20 (0x0014) [0x0000000000000000]               
	struct FLinearColor                                LightBarColor;                                 // 0x0B34 (0x0010) [0x0000000000000000]               
	float                                              LightBarPulsePhase;                            // 0x0B44 (0x0004) [0x0000000000000000]               
	TArray<struct FName>                               CompletedRecordingMoments;                     // 0x0B48 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               UnreadRecordingMoments;                        // 0x0B58 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class AOLRecordingMarker*                          PendingRecordingMarker;                        // 0x0B68 (0x0008) [0x0000000000000000]               
	float                                              RecordingCompletedTime;                        // 0x0B70 (0x0004) [0x0000000000000000]               
	struct FStruggleData                               Struggle;                                      // 0x0B74 (0x00CC) [0x0000000000402000] (CPF_Transient | CPF_NeedCtorLink)
	float                                              StruggleInputThresholdForWin;                  // 0x0C40 (0x0004) [0x0000000000004000] (CPF_Config)  
	float                                              StruggleShakesThresholdForWin;                 // 0x0C44 (0x0004) [0x0000000000004000] (CPF_Config)  
	float                                              StruggleInputThresholdForWinNoFail;            // 0x0C48 (0x0004) [0x0000000000004000] (CPF_Config)  
	float                                              StruggleShakesThresholdForWinNoFail;           // 0x0C4C (0x0004) [0x0000000000004000] (CPF_Config)  
	float                                              AIDistance;                                    // 0x0C50 (0x0004) [0x0000000000000000]               
	float                                              OverriddenMusicDistance;                       // 0x0C54 (0x0004) [0x0000000000000000]               
	float                                              AIChaseMusicTimer;                             // 0x0C58 (0x0004) [0x0000000000000000]               
	float                                              AIChaseMusicTimeDelay;                         // 0x0C5C (0x0004) [0x0000000000004000] (CPF_Config)  
	struct FName                                       MusicAIStateGroup;                             // 0x0C60 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FName                                       MusicAIStateNone;                              // 0x0C68 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FName                                       MusicAIStatePatrol;                            // 0x0C70 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FName                                       MusicAIStateInvestigate;                       // 0x0C78 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FName                                       MusicAIStateChase;                             // 0x0C80 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FName                                       LoadingStateGroup;                             // 0x0C88 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FName                                       LoadingStateOn;                                // 0x0C90 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FName                                       LoadingStateOff;                               // 0x0C98 (0x0008) [0x0000000000000002] (CPF_Const)   
