/*
#############################################################################################
# Outlast (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: UDKBase_classes.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_SABM_FIND_FIRST_BIND                              -
#define CONST_INVALIDFIELD                                      -

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum UDKBase.CastlePC.ETutorialStage
enum class ETutorialStage : uint8_t
{
	ETS_None                                           = 0,
	ETS_Tap                                            = 1,
	ETS_Swipe                                          = 2,
	ETS_Sticks                                         = 3,
	ETS_Done                                           = 4,
	ETS_END                                            = 5
};

// Enum UDKBase.UDKAnimBlendByFall.EBlendFallTypes
enum class EBlendFallTypes : uint8_t
{
	FBT_Up                                             = 0,
	FBT_Down                                           = 1,
	FBT_PreLand                                        = 2,
	FBT_Land                                           = 3,
	FBT_DblJumpUp                                      = 4,
	FBT_DblJumpDown                                    = 5,
	FBT_DblJumpPreLand                                 = 6,
	FBT_DblJumpLand                                    = 7,
	FBT_None                                           = 8,
	FBT_END                                            = 9
};

// Enum UDKBase.UDKAnimBlendByFlying.EFlyingState
enum class EFlyingState : uint8_t
{
	Flying_NotFlying                                   = 0,
	Flying_OpeningWings                                = 1,
	Flying_Flying                                      = 2,
	Flying_ClosingWings                                = 3,
	Flying_END                                         = 4
};

// Enum UDKBase.UDKMapMusicInfo.ECrossfadeType
enum class ECrossfadeType : uint8_t
{
	CFT_BeginningOfMeasure                             = 0,
	CFT_EndOfMeasure                                   = 1,
	CFT_END                                            = 2
};

// Enum UDKBase.UDKUIDataProvider_MenuOption.EUTOptionType
enum class EUTOptionType : uint8_t
{
	UTOT_ComboReadOnly                                 = 0,
	UTOT_ComboNumeric                                  = 1,
	UTOT_CheckBox                                      = 2,
	UTOT_Slider                                        = 3,
	UTOT_Spinner                                       = 4,
	UTOT_EditBox                                       = 5,
	UTOT_CollectionCheckBox                            = 6,
	UTOT_END                                           = 7
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class UDKBase.MobileHUDExt
// 0x0044 OR 0x06C0 (0x06C0 - 0x067C)
// 68 OR 1728 (1728 - 1660)
class AMobileHUDExt : public AMobileHUD
{
public:
	class UTexture2D*                                  TapToMoveTexture;                              // 0x067C (0x0008) [0x0000000000000000]               
	float                                              LastTapToMoveEffectTime;                       // 0x0684 (0x0004) [0x0000000000000000]               
	struct FVector2D                                   TapToMoveEffectPos;                            // 0x0688 (0x0008) [0x0000000000000000]               
	uint32_t                                           bFlashJoysticks : 1;                           // 0x0690 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              FlashTime;                                     // 0x0694 (0x0004) [0x0000000000000000]               
	class UFont*                                       BenchmarkFont;                                 // 0x0698 (0x0008) [0x0000000000000000]               
	class UTexture2D*                                  BenchmarkBackground;                           // 0x06A0 (0x0008) [0x0000000000000000]               
	struct FTextureUVs                                 BenchmarkBackgroundUVs;                        // 0x06A8 (0x0010) [0x0000000000000000]               
	float                                              BenchmarkResolutionScale;                      // 0x06B8 (0x0004) [0x0000000000000000]               
	int32_t                                            BenchmarkFeatureLevel;                         // 0x06BC (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.MobileHUDExt");
		}

		return uClassPointer;
	};

	void FlashSticks();
	void DrawMobileZone_Joystick(class UMobileInputZone* Zone);
	void DrawMobileZone_Slider(class UMobileInputZone* Zone);
	void PostRender();
	bool ShowMobileHud();
	void ConditionallyDrawTapToMoveEffect();
	void StartTapToMoveEffect(float X, float Y);
	void UpdateBenchmarkInformation();
};

// Class UDKBase.ParticleModuleTypeDataSnow
// 0x00E4 OR 0x0150 (0x0150 - 0x006C)
// 228 OR 336 (336 - 108)
class UParticleModuleTypeDataSnow : public UParticleModuleTypeDataBase
{
public:
	struct FRawDistributionVector                      StartSize;                                     // 0x006C (0x0024) [0x0000000000480001] (CPF_Edit | CPF_Component | CPF_NeedCtorLink)
	struct FRawDistributionVector                      StartVelocity;                                 // 0x0090 (0x0024) [0x0000000000480001] (CPF_Edit | CPF_Component | CPF_NeedCtorLink)
	struct FRawDistributionVector                      StartLocation;                                 // 0x00B4 (0x0024) [0x0000000000480001] (CPF_Edit | CPF_Component | CPF_NeedCtorLink)
	struct FRawDistributionVector                      ColorOverLife;                                 // 0x00D8 (0x0024) [0x0000000000480001] (CPF_Edit | CPF_Component | CPF_NeedCtorLink)
	struct FRawDistributionFloat                       AlphaOverLife;                                 // 0x00FC (0x0024) [0x0000000000480001] (CPF_Edit | CPF_Component | CPF_NeedCtorLink)
	struct FRawDistributionFloat                       Lifetime;                                      // 0x0120 (0x0024) [0x0000000000480001] (CPF_Edit | CPF_Component | CPF_NeedCtorLink)
	float                                              KillHeight;                                    // 0x0144 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FadeStart;                                     // 0x0148 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FadeStop;                                      // 0x014C (0x0004) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.ParticleModuleTypeDataSnow");
		}

		return uClassPointer;
	};

};

// Class UDKBase.SimpleGame
// 0x0000 OR 0x049C (0x049C - 0x049C)
// 0 OR 1180 (1180 - 1180)
class ASimpleGame : public AFrameworkGame
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.SimpleGame");
		}

		return uClassPointer;
	};

	static class UClass* eventSetGameType(class FString MapName, class FString Options, class FString Portal);
	static class FString StripPlayOnPrefix(class FString MapName);
};

// Class UDKBase.UDKGame
// 0x0000 OR 0x049C (0x049C - 0x049C)
// 0 OR 1180 (1180 - 1180)
class AUDKGame : public ASimpleGame
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKGame");
		}

		return uClassPointer;
	};

};

// Class UDKBase.UDKAIDecisionComponent
// 0x0007 OR 0x008C (0x008C - 0x0085)
// 7 OR 140 (140 - 133)
class UUDKAIDecisionComponent : public UActorComponent
{
public:
	uint32_t                                           bTriggered : 1;                                // 0x0088 (0x0004) [0x0000000000000000] [0x00000001] 

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKAIDecisionComponent");
		}

		return uClassPointer;
	};

};

// Class UDKBase.UDKBot
// 0x00FC OR 0x054C (0x054C - 0x0450)
// 252 OR 1356 (1356 - 1104)
class AUDKBot : public AAIController
{
public:
	class AUDKSquadAI*                                 Squad;                                         // 0x0450 (0x0008) [0x0000000000000000]               
	class UUDKAIDecisionComponent*                     DecisionComponent;                             // 0x0458 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class AActor*                                      TemporaryFocus;                                // 0x0460 (0x0008) [0x0000000000000000]               
	uint32_t                                           bExecutingWhatToDoNext : 1;                    // 0x0468 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bScriptSpecialJumpCost : 1;                    // 0x0468 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bForceRefreshRoute : 1;                        // 0x0468 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bTargetAlternateLoc : 1;                       // 0x0468 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bEnemyInfoValid : 1;                           // 0x0468 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bEnemyIsVisible : 1;                           // 0x0468 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bLeadTarget : 1;                               // 0x0468 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           bJumpOverWall : 1;                             // 0x0468 (0x0004) [0x0000000000000000] [0x00000080] 
	uint32_t                                           bPlannedJump : 1;                              // 0x0468 (0x0004) [0x0000000000000000] [0x00000100] 
	uint32_t                                           bInDodgeMove : 1;                              // 0x0468 (0x0004) [0x0000000000000000] [0x00000200] 
	uint32_t                                           bEnemyAcquired : 1;                            // 0x0468 (0x0004) [0x0000000000000000] [0x00000400] 
	uint32_t                                           bNeedDelayedLeaveVehicle : 1;                  // 0x0468 (0x0004) [0x0000000000000000] [0x00000800] 
	uint32_t                                           bAllowRouteReuse : 1;                          // 0x0468 (0x0004) [0x0000000000000000] [0x00001000] 
	uint32_t                                           bUsingSquadRoute : 1;                          // 0x0468 (0x0004) [0x0000000000000000] [0x00002000] 
	uint32_t                                           bUsePreviousSquadRoute : 1;                    // 0x0468 (0x0004) [0x0000000000000000] [0x00004000] 
	uint8_t                                            ScriptedFireMode;                              // 0x046C (0x0001) [0x0000000000000000]               
	float                                              EnemyVisibilityTime;                           // 0x0470 (0x0004) [0x0000000000000000]               
	class APawn*                                       VisibleEnemy;                                  // 0x0474 (0x0008) [0x0000000000000000]               
	class AVehicle*                                    LastBlockingVehicle;                           // 0x047C (0x0008) [0x0000000000000000]               
	class APawn*                                       CurrentlyTrackedEnemy;                         // 0x0484 (0x0008) [0x0000000000000000]               
	TArray<struct FEnemyPosition>                      SavedPositions;                                // 0x048C (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FVector                                     ImpactVelocity;                                // 0x049C (0x000C) [0x0000000000000000]               
	int32_t                                            AcquisitionYawRate;                            // 0x04A8 (0x0004) [0x0000000000000000]               
	float                                              HearingThreshold;                              // 0x04AC (0x0004) [0x0000000000000000]               
	float                                              RespawnPredictionTime;                         // 0x04B0 (0x0004) [0x0000000000000000]               
	float                                              WarningDelay;                                  // 0x04B4 (0x0004) [0x0000000000000000]               
	class AProjectile*                                 WarningProjectile;                             // 0x04B8 (0x0008) [0x0000000000000000]               
	struct FVector                                     MonitorStartLoc;                               // 0x04C0 (0x000C) [0x0000000000000000]               
	class APawn*                                       MonitoredPawn;                                 // 0x04CC (0x0008) [0x0000000000000000]               
	float                                              MonitorMaxDistSq;                              // 0x04D4 (0x0004) [0x0000000000000000]               
	struct FVector                                     LastSeenPos;                                   // 0x04D8 (0x000C) [0x0000000000000000]               
	struct FVector                                     LastSeeingPos;                                 // 0x04E4 (0x000C) [0x0000000000000000]               
	float                                              LastSeenTime;                                  // 0x04F0 (0x0004) [0x0000000000000000]               
	float                                              TrackingReactionTime;                          // 0x04F4 (0x0004) [0x0000000000000000]               
	float                                              BaseTrackingReactionTime;                      // 0x04F8 (0x0004) [0x0000000000000000]               
	struct FVector                                     TrackedVelocity;                               // 0x04FC (0x000C) [0x0000000000000000]               
	class ANavigationPoint*                            SquadRouteGoal;                                // 0x0508 (0x0008) [0x0000000000000000]               
	class APawn*                                       BlockedAimTarget;                              // 0x0510 (0x0008) [0x0000000000000000]               
	float                                              LastIterativeCheck;                            // 0x0518 (0x0004) [0x0000000000000000]               
	float                                              AimUpdateFrequency;                            // 0x051C (0x0004) [0x0000000000000000]               
	float                                              LastAimUpdateTime;                             // 0x0520 (0x0004) [0x0000000000000000]               
	float                                              ErrorUpdateFrequency;                          // 0x0524 (0x0004) [0x0000000000000000]               
	float                                              LastErrorUpdateTime;                           // 0x0528 (0x0004) [0x0000000000000000]               
	float                                              CurrentAimError;                               // 0x052C (0x0004) [0x0000000000000000]               
	float                                              DodgeLandZ;                                    // 0x0530 (0x0004) [0x0000000000000000]               
	class AActor*                                      FearSpots[0x2];                                // 0x0534 (0x0010) [0x0000000000000000]               
	float                                              DodgeToGoalPct;                                // 0x0544 (0x0004) [0x0000000000000000]               
	float                                              MultiJumpZ;                                    // 0x0548 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKBot");
		}

		return uClassPointer;
	};

	void eventDelayedLeaveVehicle();
	void eventDelayedWarning();
	void eventMissedDodge();
	float eventAdjustAimError(float TargetDist, bool bInstantProj);
	float eventSuperDesireability(class APickupFactory* P);
	bool eventSpecialJumpCost(float RequiredJumpZ, float& Cost);
	void eventMayDodgeToMoveTarget();
	void eventTimeDJReset();
	void eventMonitoredPawnAlert();
	void eventWhatToDoNext();
	class AActor* FindBestSuperPickup(float MaxDist);
	void BuildSquadRoute();
	class AActor* FindPathToSquadRoute(bool optionalBWeightDetours);
	class AActor* FindBestInventoryPath(float& MinWeight);
	bool CanMakePathTo(class AActor* A);
	void LatentWhatToDoNext();
	void WaitToSeeEnemy();
	void eventReceiveRunOverWarning(class AUDKVehicle* V, float projSpeed, struct FVector VehicleDir);
	void eventExecuteWhatToDoNext();
	class AActor* FaceActor(float StrafingModifier);
};

// Class UDKBase.UDKCarriedObject
// 0x0050 OR 0x0290 (0x0290 - 0x0240)
// 80 OR 656 (656 - 576)
class AUDKCarriedObject : public AActor
{
public:
	class ATeamInfo*                                   Team;                                          // 0x0240 (0x0008) [0x0000000100000020] (CPF_Net)     
	class ANavigationPoint*                            LastAnchor;                                    // 0x0248 (0x0008) [0x0000000000000002] (CPF_Const)   
	float                                              LastValidAnchorTime;                           // 0x0250 (0x0004) [0x0000000000000000]               
	class USkeletalMeshComponent*                      SkelMesh;                                      // 0x0254 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	uint32_t                                           bHome : 1;                                     // 0x025C (0x0004) [0x0000000100000020] [0x00000001] (CPF_Net)
	class AUDKGameObjective*                           HomeBase;                                      // 0x0260 (0x0008) [0x0000000000000020] (CPF_Net)     
	struct FVector                                     HomeBaseOffset;                                // 0x0268 (0x000C) [0x0000000000000000]               
	class AActor*                                      OldBase;                                       // 0x0274 (0x0008) [0x0000000000000000]               
	class AActor*                                      OldBaseBase;                                   // 0x027C (0x0008) [0x0000000000000000]               
	struct FVector                                     HUDLocation;                                   // 0x0284 (0x000C) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKCarriedObject");
		}

		return uClassPointer;
	};

	uint8_t GetTeamNum();
	void eventOnBaseChainChanged();
	void eventNotReachableBy(class APawn* P);
	void SetHUDLocation(struct FVector NewHUDLocation);
};

// Class UDKBase.UDKDataStore_GameSearchBase
// 0x0008 OR 0x00D8 (0x00D8 - 0x00D0)
// 8 OR 216 (216 - 208)
class UUDKDataStore_GameSearchBase : public UUIDataStore_OnlineGameSearch
{
public:
	class UUDKUIDataProvider_ServerDetails*            ServerDetailsProvider;                         // 0x00D0 (0x0008) [0x0000000000002000] (CPF_Transient)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKDataStore_GameSearchBase");
		}

		return uClassPointer;
	};

	bool HasExistingSearchResults();
	bool HasOutstandingQueries(bool optionalBRestrictCheckToSelf);
	void OnSearchComplete(bool bWasSuccessful);
	bool eventSubmitGameSearch(uint8_t ControllerIndex, bool optionalBInvalidateExistingSearchResults);
	void eventInit();
};

// Class UDKBase.UDKEmitCameraEffect
// 0x000C OR 0x0260 (0x0260 - 0x0254)
// 12 OR 608 (608 - 596)
class AUDKEmitCameraEffect : public AEmitter
{
public:
	float                                              DistFromCamera;                                // 0x0254 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class AUDKPlayerController*                        Cam;                                           // 0x0258 (0x0008) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKEmitCameraEffect");
		}

		return uClassPointer;
	};

	void UpdateLocation(float CamFOVDeg, struct FVector& CamLoc, struct FRotator& CamRot);
	void RegisterCamera(class AUDKPlayerController* inCam);
	void Destroyed();
	void eventPostBeginPlay();
};

// Class UDKBase.UDKEmitterPool
// 0x0010 OR 0x02C0 (0x02C0 - 0x02B0)
// 16 OR 704 (704 - 688)
class AUDKEmitterPool : public AEmitterPool
{
public:
	TArray<struct FAttachedExplosionLight>             RelativeExplosionLights;                       // 0x02B0 (0x0010) [0x0000000000480000] (CPF_Component | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKEmitterPool");
		}

		return uClassPointer;
	};

	class UUDKExplosionLight* SpawnExplosionLight(class UClass* LightClass, struct FVector SpawnLocation, class AActor* optionalAttachToActor);
	void OnExplosionLightFinished(class UUDKExplosionLight* Light);
	class UParticleSystemComponent* SpawnEmitter(class UParticleSystem* EmitterTemplate, struct FVector SpawnLocation, struct FRotator optionalSpawnRotation, class AActor* optionalAttachToActor, class AActor* optionalInInstigator, int32_t optionalMaxDLEPooledReuses, bool optionalBInheritScaleFromBase);
};

// Class UDKBase.UDKExplosionLight
// 0x0030 OR 0x0280 (0x0280 - 0x0250)
// 48 OR 640 (640 - 592)
class UUDKExplosionLight : public UPointLightComponent
{
public:
	uint32_t                                           bCheckFrameRate : 1;                           // 0x0250 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bInitialized : 1;                              // 0x0250 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              HighDetailFrameTime;                           // 0x0254 (0x0004) [0x0000000000000000]               
	float                                              Lifetime;                                      // 0x0258 (0x0004) [0x0000000000000000]               
	int32_t                                            TimeShiftIndex;                                // 0x025C (0x0004) [0x0000000000000000]               
	TArray<struct FLightValues>                        TimeShift;                                     // 0x0260 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FScriptDelegate                             __OnLightFinished__Delegate;                   // 0x0270 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKExplosionLight");
		}

		return uClassPointer;
	};

	void OnLightFinished(class UUDKExplosionLight* Light);
	void ResetLight();
};

// Class UDKBase.UDKForcedDirectionVolume
// 0x0030 OR 0x0304 (0x0304 - 0x02D4)
// 48 OR 772 (772 - 724)
class AUDKForcedDirectionVolume : public APhysicsVolume
{
public:
	class UClass*                                      TypeToForce;                                   // 0x02D4 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bIgnoreHoverboards : 1;                        // 0x02DC (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bDenyExit : 1;                                 // 0x02DC (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bBlockPawns : 1;                               // 0x02DC (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bBlockSpectators : 1;                          // 0x02DC (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	class UArrowComponent*                             Arrow;                                         // 0x02E0 (0x0008) [0x000000000408000B] (CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline)
	struct FVector                                     ArrowDirection;                                // 0x02E8 (0x000C) [0x0000000000000000]               
	TArray<class AUDKVehicle*>                         TouchingVehicles;                              // 0x02F4 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKForcedDirectionVolume");
		}

		return uClassPointer;
	};

	bool StopsProjectile(class AProjectile* P);
	void eventUnTouch(class AActor* Other);
	void eventTouch(class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal);
	void eventActorEnteredVolume(class AActor* Other);
	void PostBeginPlay();
};

// Class UDKBase.UDKGameInteraction
// 0x0004 OR 0x01D8 (0x01D8 - 0x01D4)
// 4 OR 472 (472 - 468)
class UUDKGameInteraction : public UUIInteraction
{
public:
	int32_t                                            BlockUIInputSemaphore;                         // 0x01D4 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKGameInteraction");
		}

		return uClassPointer;
	};

	void NotifyGameSessionEnded();
	void eventBlockUIInput(bool bBlock);
	void eventClearUIInputBlocks();
	bool ShouldProcessUIInput();
};

// Class UDKBase.UDKGameObjective
// 0x0039 OR 0x0391 (0x0391 - 0x0358)
// 57 OR 913 (913 - 856)
class AUDKGameObjective : public ANavigationPoint
{
public:
	TArray<class ANavigationPoint*>                    ShootSpots;                                    // 0x0358 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bAllowOnlyShootable : 1;                       // 0x0368 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bUnderAttack : 1;                              // 0x0368 (0x0004) [0x0000000100000020] [0x00000002] (CPF_Net)
	struct FVector                                     HUDLocation;                                   // 0x036C (0x000C) [0x0000000000000000]               
	class UTexture2D*                                  IconHudTexture;                                // 0x0378 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FTextureCoordinates                         IconCoords;                                    // 0x0380 (0x0010) [0x0000000000000000]               
	uint8_t                                            DefenderTeamIndex;                             // 0x0390 (0x0001) [0x0000000100000020] (CPF_Net)     

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKGameObjective");
		}

		return uClassPointer;
	};

	uint8_t GetTeamNum();
	void DrawIcon(class UCanvas* Canvas, struct FVector IconLocation, float IconWidth, float IconAlpha, class AUDKPlayerController* PlayerOwner, struct FLinearColor DrawColor);
	void SetHUDLocation(struct FVector NewHUDLocation);
	void TriggerFlagEvent(struct FName EventType, class AController* EventInstigator);
	bool BotNearObjective(class AAIController* C);
	class AActor* eventGetBestViewTarget();
	void ObjectiveChanged();
};

// Class UDKBase.UDKGameSettingsCommon
// 0x0000 OR 0x00EC (0x00EC - 0x00EC)
// 0 OR 236 (236 - 236)
class UUDKGameSettingsCommon : public UOnlineGameSettings
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKGameSettingsCommon");
		}

		return uClassPointer;
	};

	static class FString BlobToString(class FString& InBlob);
	static bool StringToBlob(class FString& InString, class FString& OutBlob);
};

// Class UDKBase.UDKGameViewportClient
// 0x0010 OR 0x01B0 (0x01B0 - 0x01A0)
// 16 OR 432 (432 - 416)
class UUDKGameViewportClient : public UGameViewportClient
{
public:
	class FString                                      HintLocFileName;                               // 0x01A0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKGameViewportClient");
		}

		return uClassPointer;
	};

	class FString LoadRandomLocalizedHintMessage(class FString Category1Name, class FString Category2Name);
};

// Class UDKBase.UDKHUD
// 0x0054 OR 0x06D0 (0x06D0 - 0x067C)
// 84 OR 1744 (1744 - 1660)
class AUDKHUD : public AMobileHUD
{
public:
	class UFont*                                       GlowFonts[0x2];                                // 0x067C (0x0010) [0x0000000000000000]               
	float                                              PulseDuration;                                 // 0x068C (0x0004) [0x0000000000000000]               
	float                                              PulseSplit;                                    // 0x0690 (0x0004) [0x0000000000000000]               
	float                                              PulseMultiplier;                               // 0x0694 (0x0004) [0x0000000000000000]               
	struct FFontRenderInfo                             TextRenderInfo;                                // 0x0698 (0x0028) [0x0000000000000000]               
	class UFont*                                       ConsoleIconFont;                               // 0x06C0 (0x0008) [0x0000000000000000]               
	class UFont*                                       BindTextFont;                                  // 0x06C8 (0x0008) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKHUD");
		}

		return uClassPointer;
	};

	static void TranslateBindToFont(class FString InBindStr, class UFont*& DrawFont, class FString& OutBindStr);
	void DrawGlowText(class FString Text, float X, float Y, float optionalMaxHeightInPixels, float optionalPulseTime, bool optionalBRightJustified);
};

// Class UDKBase.UDKJumpPad
// 0x002C OR 0x0384 (0x0384 - 0x0358)
// 44 OR 900 (900 - 856)
class AUDKJumpPad : public ANavigationPoint
{
public:
	struct FVector                                     JumpVelocity;                                  // 0x0358 (0x000C) [0x0000000000000000]               
	class APathNode*                                   JumpTarget;                                    // 0x0364 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class USoundCue*                                   JumpSound;                                     // 0x036C (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              JumpTime;                                      // 0x0374 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              JumpAirControl;                                // 0x0378 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UAudioComponent*                             JumpAmbientSound;                              // 0x037C (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKJumpPad");
		}

		return uClassPointer;
	};

	bool eventSuggestMovePreparation(class APawn* Other);
	void eventPostTouch(class AActor* Other);
	void eventTouch(class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal);
};

// Class UDKBase.UDKKActorBreakable
// 0x004C OR 0x03B4 (0x03B4 - 0x0368)
// 76 OR 948 (948 - 872)
class AUDKKActorBreakable : public AKActor
{
public:
	uint32_t                                           bHasHealth : 1;                                // 0x0368 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bDamageOnEncroachment : 1;                     // 0x0368 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bResetDOEWhenAsleep : 1;                       // 0x0368 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bTakeDamageOnEncroachment : 1;                 // 0x0368 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bBreakWhenCausingDamage : 1;                   // 0x0368 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	uint32_t                                           bBroken : 1;                                   // 0x0368 (0x0004) [0x0000000100000000] [0x00000020] 
	int32_t                                            Health;                                        // 0x036C (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            EncroachDamage_Other;                          // 0x0370 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            EncroachDamage_Self;                           // 0x0374 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UClass*                                      DmgTypeClass;                                  // 0x0378 (0x0008) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            DOEResetThreshold;                             // 0x0380 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UParticleSystem*                             BrokenTemplate;                                // 0x0384 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class AController*                                 InstigatorController;                          // 0x038C (0x0008) [0x0000000000000000]               
	struct FScriptDelegate                             __OnBreakApart__Delegate;                      // 0x0394 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FScriptDelegate                             __OnEncroach__Delegate;                        // 0x03A4 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKKActorBreakable");
		}

		return uClassPointer;
	};

	void eventReplicatedEvent(struct FName VarName);
	void BreakApart();
	bool EncroachingOn(class AActor* Other);
	void eventTakeDamage(int32_t Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo optionalHitInfo, class AActor* optionalDamageCauser);
	bool OnEncroach(class AActor* Other);
	void OnBreakApart();
};

// Class UDKBase.UDKMapInfo
// 0x0004 OR 0x0064 (0x0064 - 0x0060)
// 4 OR 100 (100 - 96)
class UUDKMapInfo : public UMapInfo
{
public:
	float                                              VisibilityModifier;                            // 0x0060 (0x0004) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKMapInfo");
		}

		return uClassPointer;
	};

};

// Class UDKBase.UDKMapMusicInfo
// 0x00F4 OR 0x0154 (0x0154 - 0x0060)
// 244 OR 340 (340 - 96)
class UUDKMapMusicInfo : public UObject
{
public:
	struct FMusicForAMap                               MapMusic;                                      // 0x0060 (0x007C) [0x0000000000000001] (CPF_Edit)    
	struct FStingersForAMap                            MapStingers;                                   // 0x00DC (0x0078) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKMapMusicInfo");
		}

		return uClassPointer;
	};

};

// Class UDKBase.UDKParticleSystemComponent
// 0x0014 OR 0x0398 (0x0398 - 0x0384)
// 20 OR 920 (920 - 900)
class UUDKParticleSystemComponent : public UParticleSystemComponent
{
public:
	float                                              FOV;                                           // 0x0384 (0x0004) [0x0000000000000002] (CPF_Const)   
	uint32_t                                           bHasSavedScale3D : 1;                          // 0x0388 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	struct FVector                                     SavedScale3D;                                  // 0x038C (0x000C) [0x0000000000000002] (CPF_Const)   

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKParticleSystemComponent");
		}

		return uClassPointer;
	};

	void SetFOV(float NewFOV);
};

// Class UDKBase.UDKPawn
// 0x0238 OR 0x078C (0x078C - 0x0554)
// 568 OR 1932 (1932 - 1364)
class AUDKPawn : public AGamePawn
{
public:
	uint32_t                                           bReadyToDoubleJump : 1;                        // 0x0554 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bRequiresDoubleJump : 1;                       // 0x0554 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bCanDoubleJump : 1;                            // 0x0554 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bNoJumpAdjust : 1;                             // 0x0554 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bIsHoverboardAnimPawn : 1;                     // 0x0554 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bFeigningDeath : 1;                            // 0x0554 (0x0004) [0x0000000100000020] [0x00000020] (CPF_Net)
	uint32_t                                           bNotifyStopFalling : 1;                        // 0x0554 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           bIsInvisible : 1;                              // 0x0554 (0x0004) [0x0000000100000020] [0x00000080] (CPF_Net)
	uint32_t                                           bSmoothNetUpdates : 1;                         // 0x0554 (0x0004) [0x0000000000000000] [0x00000100] 
	uint32_t                                           bPuttingDownWeapon : 1;                        // 0x0554 (0x0004) [0x0000000100000020] [0x00000200] (CPF_Net)
	uint32_t                                           bPlayingFeignDeathRecovery : 1;                // 0x0554 (0x0004) [0x0000000000000000] [0x00000400] 
	uint32_t                                           bCanPlayFallingImpacts : 1;                    // 0x0554 (0x0004) [0x0000000000000000] [0x00000800] 
	uint32_t                                           bEnableFootPlacement : 1;                      // 0x0554 (0x0004) [0x0000000000000000] [0x00001000] 
	uint32_t                                           bPostRenderOtherTeam : 1;                      // 0x0554 (0x0004) [0x0000000000000000] [0x00002000] 
	uint32_t                                           bBlendOutTakeHitPhysics : 1;                   // 0x0554 (0x0004) [0x0000000000000000] [0x00004000] 
	uint32_t                                           bUpdateEyeheight : 1;                          // 0x0554 (0x0004) [0x0000000000000000] [0x00008000] 
	uint32_t                                           bTearOffGibs : 1;                              // 0x0554 (0x0004) [0x0000000000000020] [0x00010000] (CPF_Net)
	float                                              MaxDoubleJumpHeight;                           // 0x0558 (0x0004) [0x0000000000000000]               
	int32_t                                            MultiJumpRemaining;                            // 0x055C (0x0004) [0x0000000000000000]               
	int32_t                                            MaxMultiJump;                                  // 0x0560 (0x0004) [0x0000000000000000]               
	int32_t                                            MultiJumpBoost;                                // 0x0564 (0x0004) [0x0000000000000000]               
	float                                              CustomGravityScaling;                          // 0x0568 (0x0004) [0x0000000000000020] (CPF_Net)     
	struct FPlayEmoteInfo                              EmoteRepInfo;                                  // 0x056C (0x0010) [0x0000000100000020] (CPF_Net)     
	float                                              LastEmoteTime;                                 // 0x057C (0x0004) [0x0000000000000000]               
	float                                              MinTimeBetweenEmotes;                          // 0x0580 (0x0004) [0x0000000000000000]               
	uint8_t                                            BigTeleportCount;                              // 0x0584 (0x0001) [0x0000000100000020] (CPF_Net)     
	uint8_t                                            WeaponOverlayFlags;                            // 0x0585 (0x0001) [0x0000000100000020] (CPF_Net)     
	struct FUTTakeHitInfo                              LastTakeHitInfo;                               // 0x0588 (0x002C) [0x0000000100000020] (CPF_Net)     
	float                                              LastTakeHitTimeout;                            // 0x05B4 (0x0004) [0x0000000000000000]               
	float                                              FireRateMultiplier;                            // 0x05B8 (0x0004) [0x0000000100000020] (CPF_Net)     
	float                                              HeadScale;                                     // 0x05BC (0x0004) [0x0000000100000020] (CPF_Net)     
	float                                              MaxSmoothNetUpdateDist;                        // 0x05C0 (0x0004) [0x0000000000000000]               
	float                                              NoSmoothNetUpdateDist;                         // 0x05C4 (0x0004) [0x0000000000000000]               
	float                                              SmoothNetUpdateTime;                           // 0x05C8 (0x0004) [0x0000000000000000]               
	struct FVector                                     MeshTranslationOffset;                         // 0x05CC (0x000C) [0x0000000000000000]               
	float                                              OldZ;                                          // 0x05D8 (0x0004) [0x0000000000000000]               
	class UAudioComponent*                             PawnAmbientSound;                              // 0x05DC (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class USoundCue*                                   PawnAmbientSoundCue;                           // 0x05E4 (0x0008) [0x0000000100000020] (CPF_Net)     
	struct FDrivenWeaponPawnInfo                       DrivenWeaponPawn;                              // 0x05EC (0x0014) [0x0000000100000020] (CPF_Net)     
	class UAudioComponent*                             WeaponAmbientSound;                            // 0x0600 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class USoundCue*                                   WeaponAmbientSoundCue;                         // 0x0608 (0x0008) [0x0000000100000020] (CPF_Net)     
	class UMaterial*                                   ReplicatedBodyMaterial;                        // 0x0610 (0x0008) [0x0000000100000020] (CPF_Net)     
	TArray<class UMaterialInstanceConstant*>           BodyMaterialInstances;                         // 0x0618 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UMaterialInterface*                          OverlayMaterialInstance;                       // 0x0628 (0x0008) [0x0000000100000020] (CPF_Net)     
	class USkelControlSingleBone*                      RootRotControl;                                // 0x0630 (0x0008) [0x0000000000000000]               
	class UAnimNodeAimOffset*                          AimNode;                                       // 0x0638 (0x0008) [0x0000000000000000]               
	class UGameSkelCtrl_Recoil*                        GunRecoilNode;                                 // 0x0640 (0x0008) [0x0000000000000000]               
	class UGameSkelCtrl_Recoil*                        LeftRecoilNode;                                // 0x0648 (0x0008) [0x0000000000000000]               
	class UGameSkelCtrl_Recoil*                        RightRecoilNode;                               // 0x0650 (0x0008) [0x0000000000000000]               
	TArray<class AUDKBot*>                             Trackers;                                      // 0x0658 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              BodyMatFadeDuration;                           // 0x0668 (0x0004) [0x0000000000000000]               
	struct FLinearColor                                CurrentBodyMatColor;                           // 0x066C (0x0010) [0x0000000000000000]               
	float                                              RemainingBodyMatDuration;                      // 0x067C (0x0004) [0x0000000000000000]               
	float                                              ClientBodyMatDuration;                         // 0x0680 (0x0004) [0x0000000100000020] (CPF_Net)     
	struct FLinearColor                                BodyMatColor;                                  // 0x0684 (0x0010) [0x0000000000000000]               
	struct FRotator                                    CompressedBodyMatColor;                        // 0x0694 (0x000C) [0x0000000100000020] (CPF_Net)     
	float                                              StartFallImpactTime;                           // 0x06A0 (0x0004) [0x0000000000000000]               
	struct FName                                       TorsoBoneName;                                 // 0x06A4 (0x0008) [0x0000000000000000]               
	class USoundCue*                                   FallImpactSound;                               // 0x06AC (0x0008) [0x0000000000000000]               
	float                                              FallSpeedThreshold;                            // 0x06B4 (0x0004) [0x0000000000000000]               
	class UStaticMeshComponent*                        BlobShadow;                                    // 0x06B8 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class USkeletalMeshComponent*                      OverlayMesh;                                   // 0x06C0 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	struct FName                                       LeftFootBone;                                  // 0x06C8 (0x0008) [0x0000000000000000]               
	struct FName                                       RightFootBone;                                 // 0x06D0 (0x0008) [0x0000000000000000]               
	struct FName                                       LeftFootControlName;                           // 0x06D8 (0x0008) [0x0000000000000000]               
	struct FName                                       RightFootControlName;                          // 0x06E0 (0x0008) [0x0000000000000000]               
	float                                              BaseTranslationOffset;                         // 0x06E8 (0x0004) [0x0000000000000000]               
	float                                              CrouchTranslationOffset;                       // 0x06EC (0x0004) [0x0000000000000000]               
	float                                              OldLocationZ;                                  // 0x06F0 (0x0004) [0x0000000000000000]               
	float                                              ZSmoothingRate;                                // 0x06F4 (0x0004) [0x0000000000000002] (CPF_Const)   
	float                                              MaxFootPlacementDistSquared;                   // 0x06F8 (0x0004) [0x0000000000000000]               
	class USkelControlFootPlacement*                   LeftLegControl;                                // 0x06FC (0x0008) [0x0000000000000000]               
	class USkelControlFootPlacement*                   RightLegControl;                               // 0x0704 (0x0008) [0x0000000000000000]               
	class USkelControlLimb*                            LeftHandIK;                                    // 0x070C (0x0008) [0x0000000000000000]               
	class USkelControlLimb*                            RightHandIK;                                   // 0x0714 (0x0008) [0x0000000000000000]               
	struct FName                                       DamageParameterName;                           // 0x071C (0x0008) [0x0000000000000000]               
	struct FName                                       SaturationParameterName;                       // 0x0724 (0x0008) [0x0000000000000000]               
	float                                              LastPostRenderTraceTime;                       // 0x072C (0x0004) [0x0000000000000000]               
	float                                              TeamBeaconMaxDist;                             // 0x0730 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StartedFallingTime;                            // 0x0734 (0x0004) [0x0000000000000000]               
	float                                              SlopeBoostFriction;                            // 0x0738 (0x0004) [0x0000000000000000]               
	class UAnimNodeAimOffset*                          FlyingDirOffset;                               // 0x073C (0x0008) [0x0000000000000000]               
	int32_t                                            MaxLeanRoll;                                   // 0x0744 (0x0004) [0x0000000000000000]               
	float                                              FeignDeathPhysicsBlendOutSpeed;                // 0x0748 (0x0004) [0x0000000000000000]               
	float                                              SwimmingZOffset;                               // 0x074C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              SwimmingZOffsetSpeed;                          // 0x0750 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              CrouchMeshZOffset;                             // 0x0754 (0x0004) [0x0000000000000000]               
	float                                              TakeHitPhysicsBlendOutSpeed;                   // 0x0758 (0x0004) [0x0000000000000000]               
	class UUDKSkeletalMeshComponent*                   ArmsMesh[0x2];                                 // 0x075C (0x0010) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	int32_t                                            RootYaw;                                       // 0x076C (0x0004) [0x0000000000000000]               
	float                                              RootYawSpeed;                                  // 0x0770 (0x0004) [0x0000000000000000]               
	int32_t                                            MaxYawAim;                                     // 0x0774 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector2D                                   CurrentSkelAim;                                // 0x0778 (0x0008) [0x0000000000000000]               
	struct FVector                                     HUDLocation;                                   // 0x0780 (0x000C) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class UDKBase.UDKPawn");
		}

		return uClassPointer;
	};

	void eventStuckFalling();
	void eventUpdateEyeHeight(float DeltaTime);
	void eventTakeHitBlendedOut();
	void eventStartFeignDeathRecoveryAnim();
	void SetHandIKEnabled(bool bEnabled);
	void SetWeaponAttachmentVisibility(bool bAttachmentVisible);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir);
	void SetHUDLocation(struct FVector NewHUDLocation);
	bool SuggestJumpVelocity(struct FVector Destination, struct FVector Start, bool optionalBRequireFallLanding, struct FVector& JumpVelocity);
	void eventStartCrouch(float HeightAdjust);
	void eventEndCrouch(float HeightAdjust);
	void eventStoppedFalling();
	void eventHoldGameObject(class AUDKCarriedObject* UDKGameObj);
	bool IsInvisible();
	struct FVector GetTargetLocation(class AActor* optionalRequestedBy, bool optionalBRequestAlternateLoc);
	void EnsureOverlayComponentLast();
	void RestorePreRagdollCollisionComponent();
	void GetBoundingCylinder(float& CollisionRadius, float& CollisionHeight);
};

// Class UDKBase.UDKPickupFactory
// 0x00C0 OR 0x0444 (0x0444 - 0x0384)
// 192 OR 1092 (1092 - 900)
class AUDKPickupFactory : public APickupFactory
{
public:
	uint32_t                                           bIsRespawning : 1;                             // 0x0384 (0x0004) [0x0000000100000020] [0x00000001] (CPF_Net)
	uint32_t                                           bPulseBase : 1;                                // 0x0384 (0x0004) [0x0000000100000020] [0x00000002] (CPF_Net)
	uint32_t                                           bIsDisabled : 1;                               // 0x0384 (0x0004) [0x0000000100000020] [0x00000004] (CPF_Net)
	uint32_t                                           bFloatingPickup : 1;                           // 0x0384 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bRandomStart : 1;                              // 0x0384 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bRotatingPickup : 1;                           // 0x0384 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bUpdatingPickup : 1;                           // 0x0384 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           bDoVisibilityFadeIn : 1;                       // 0x0384 (0x0004) [0x0000000000000000] [0x00000080] 
	class UStaticMeshComponent*                        BaseMesh;                                      // 0x0388 (0x0008) [0x0000000004082008] (CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline)
	class UMaterialInstanceConstant*                   BaseMaterialInstance;                          // 0x0390 (0x0008) [0x0000000000000000]               
	struct FLinearColor                                BaseBrightEmissive;                            // 0x0398 (0x0010) [0x0000000000000000]               
	struct FLinearColor                                BaseDimEmissive;                               // 0x03A8 (0x0010) [0x0000000000000000]               
	float                                              BasePulseRate;                                 // 0x03B8 (0x0004) [0x0000000000000000]               
	float                                              BasePulseTime;                                 // 0x03BC (0x0004) [0x0000000000000000]               
	float                                              PulseThreshold;                                // 0x03C0 (0x0004) [0x0000000000000000]               
	struct FLinearColor                                BaseTargetEmissive;                            // 0x03C4 (0x0010) [0x0000000000000000]               
	struct FLinearColor                                BaseEmissive;                                  // 0x03D4 (0x0010) [0x0000000000000000]               
	struct FName                                       BaseMaterialParamName;                         // 0x03E4 (0x0008) [0x0000000000000000]               
	float                                              BobTimer;                                      // 0x03EC (0x0004) [0x0000000000000000]               
	float                                              BobOffset;                                     // 0x03F0 (0x0004) [0x0000000000000000]               
	float                                              BobSpeed;                                      // 0x03F4 (0x0004) [0x0000000000000000]               
	float                                              BobBaseOffset;                                 // 0x03F8 (0x0004) [0x0000000000000000]               
	float                                              YawRotationRate;                               // 0x03FC (0x0004) [0x0000000000000000]               
	struct FVector                                     PivotTranslation;                              // 0x0400 (0x000C) [0x0000000000000000]               
	struct FName                                       VisibilityParamName;                           // 0x040C (0x0008) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   MIC_Visibility;                                // 0x0414 (0x0008) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   MIC_VisibilitySecondMaterial;                  // 0x041C (0x0008) [0x0000000000000000]               
	class UParticleSystemComponent*                    Glow;                                          // 0x0424 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	struct FName                                       GlowEmissiveParam;                             // 0x042C (0x0008) [0x0000000000000000]               
