/*
#############################################################################################
# Outlast (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: UDKBase_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function UDKBase.MobileHUDExt.FlashSticks
// [0x00020002] 
struct AMobileHUDExt_execFlashSticks_Params
{
};

// Function UDKBase.MobileHUDExt.DrawMobileZone_Joystick
// [0x00820002] 
struct AMobileHUDExt_execDrawMobileZone_Joystick_Params
{
	class UMobileInputZone*                            Zone;                                             		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                            X;                                                		// 0x0008 (0x0004) [0x0000000000000000]               
	// int32_t                                            Y;                                                		// 0x000C (0x0004) [0x0000000000000000]               
	// int32_t                                            Width;                                            		// 0x0010 (0x0004) [0x0000000000000000]               
	// int32_t                                            Height;                                           		// 0x0014 (0x0004) [0x0000000000000000]               
	// struct FColor                                      LineColor;                                        		// 0x0018 (0x0004) [0x0000000000000000]               
	// float                                              ClampedX;                                         		// 0x001C (0x0004) [0x0000000000000000]               
	// float                                              ClampedY;                                         		// 0x0020 (0x0004) [0x0000000000000000]               
	// float                                              Scale;                                            		// 0x0024 (0x0004) [0x0000000000000000]               
	// struct FColor                                      TempColor;                                        		// 0x0028 (0x0004) [0x0000000000000000]               
	// float                                              FlashScale;                                       		// 0x002C (0x0004) [0x0000000000000000]               
};

// Function UDKBase.MobileHUDExt.DrawMobileZone_Slider
// [0x00820002] 
struct AMobileHUDExt_execDrawMobileZone_Slider_Params
{
	class UMobileInputZone*                            Zone;                                             		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// struct FTextureUVs                                 UVs;                                              		// 0x0008 (0x0010) [0x0000000000000000]               
	// class UTexture2D*                                  Tex;                                              		// 0x0018 (0x0008) [0x0000000000000000]               
	// float                                              Ofs;                                              		// 0x0020 (0x0004) [0x0000000000000000]               
	// float                                              Scale;                                            		// 0x0024 (0x0004) [0x0000000000000000]               
};

// Function UDKBase.MobileHUDExt.PostRender
// [0x00020000] 
struct AMobileHUDExt_execPostRender_Params
{
};

// Function UDKBase.MobileHUDExt.ShowMobileHud
// [0x00020002] 
struct AMobileHUDExt_execShowMobileHud_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.MobileHUDExt.ConditionallyDrawTapToMoveEffect
// [0x00020002] 
struct AMobileHUDExt_execConditionallyDrawTapToMoveEffect_Params
{
	// float                                              EffectDuration;                                   		// 0x0000 (0x0004) [0x0000000000000000]               
	// float                                              EffectSize;                                       		// 0x0004 (0x0004) [0x0000000000000000]               
	// float                                              EffectOpacity;                                    		// 0x0008 (0x0004) [0x0000000000000000]               
	// float                                              FadeInPercent;                                    		// 0x000C (0x0004) [0x0000000000000000]               
	// float                                              FadeOutPercent;                                   		// 0x0010 (0x0004) [0x0000000000000000]               
	// float                                              EffectProgress;                                   		// 0x0014 (0x0004) [0x0000000000000000]               
	// float                                              AnimatedSize;                                     		// 0x0018 (0x0004) [0x0000000000000000]               
	// float                                              AnimatedOpacity;                                  		// 0x001C (0x0004) [0x0000000000000000]               
};

// Function UDKBase.MobileHUDExt.StartTapToMoveEffect
// [0x00020002] 
struct AMobileHUDExt_execStartTapToMoveEffect_Params
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.MobileHUDExt.UpdateBenchmarkInformation
// [0x00020400] 
struct AMobileHUDExt_execUpdateBenchmarkInformation_Params
{
};

// Function UDKBase.SimpleGame.SetGameType
// [0x00022802] 
struct ASimpleGame_eventSetGameType_Params
{
	class FString                                      MapName;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      Options;                                          		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      Portal;                                           		// 0x0020 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ReturnValue;                                      		// 0x0030 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class FString                                      NewMapName;                                       		// 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      GameTypeName;                                     		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      ThisMapPrefix;                                    		// 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      GameOption;                                       		// 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// int32_t                                            PrefixIndex;                                      		// 0x0078 (0x0004) [0x0000000000000000]               
	// int32_t                                            MapPrefixPos;                                     		// 0x007C (0x0004) [0x0000000000000000]               
	// int32_t                                            GameTypePrefixPos;                                		// 0x0080 (0x0004) [0x0000000000000000]               
	// class UClass*                                      UTGameType;                                       		// 0x0084 (0x0008) [0x0000000000000000]               
};

// Function UDKBase.SimpleGame.StripPlayOnPrefix
// [0x00022002] 
struct ASimpleGame_execStripPlayOnPrefix_Params
{
	class FString                                      MapName;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function UDKBase.UDKBot.DelayedLeaveVehicle
// [0x00020800] 
struct AUDKBot_eventDelayedLeaveVehicle_Params
{
};

// Function UDKBase.UDKBot.DelayedWarning
// [0x00020800] 
struct AUDKBot_eventDelayedWarning_Params
{
};

// Function UDKBase.UDKBot.MissedDodge
// [0x00020800] 
struct AUDKBot_eventMissedDodge_Params
{
};

// Function UDKBase.UDKBot.AdjustAimError
// [0x00020800] 
struct AUDKBot_eventAdjustAimError_Params
{
	float                                              TargetDist;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bInstantProj : 1;                                 		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKBot.SuperDesireability
// [0x00020800] 
struct AUDKBot_eventSuperDesireability_Params
{
	class APickupFactory*                              P;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKBot.SpecialJumpCost
// [0x00420800] 
struct AUDKBot_eventSpecialJumpCost_Params
{
	float                                              RequiredJumpZ;                                    		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Cost;                                             		// 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKBot.MayDodgeToMoveTarget
// [0x00020800] 
struct AUDKBot_eventMayDodgeToMoveTarget_Params
{
};

// Function UDKBase.UDKBot.TimeDJReset
// [0x00020800] 
struct AUDKBot_eventTimeDJReset_Params
{
};

// Function UDKBase.UDKBot.MonitoredPawnAlert
// [0x00020800] 
struct AUDKBot_eventMonitoredPawnAlert_Params
{
};

// Function UDKBase.UDKBot.WhatToDoNext
// [0x00020800] 
struct AUDKBot_eventWhatToDoNext_Params
{
};

// Function UDKBase.UDKBot.FindBestSuperPickup
// [0x00020400] 
struct AUDKBot_execFindBestSuperPickup_Params
{
	float                                              MaxDist;                                          		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKBot.BuildSquadRoute
// [0x00020401] 
struct AUDKBot_execBuildSquadRoute_Params
{
};

// Function UDKBase.UDKBot.FindPathToSquadRoute
// [0x00024401] 
struct AUDKBot_execFindPathToSquadRoute_Params
{
	uint32_t                                           bWeightDetours : 1;                               		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKBot.FindBestInventoryPath
// [0x00420401] 
struct AUDKBot_execFindBestInventoryPath_Params
{
	float                                              MinWeight;                                        		// 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class AActor*                                      ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKBot.CanMakePathTo
// [0x00020401] 
struct AUDKBot_execCanMakePathTo_Params
{
	class AActor*                                      A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKBot.LatentWhatToDoNext
// [0x00020409] 
struct AUDKBot_execLatentWhatToDoNext_Params
{
};

// Function UDKBase.UDKBot.WaitToSeeEnemy
// [0x00020409] 
struct AUDKBot_execWaitToSeeEnemy_Params
{
};

// Function UDKBase.UDKBot.ReceiveRunOverWarning
// [0x00020800] 
struct AUDKBot_eventReceiveRunOverWarning_Params
{
	class AUDKVehicle*                                 V;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              projSpeed;                                        		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     VehicleDir;                                       		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKBot.ExecuteWhatToDoNext
// [0x00080800] 
struct AUDKBot_eventExecuteWhatToDoNext_Params
{
};

// Function UDKBase.UDKBot.FaceActor
// [0x00020000] 
struct AUDKBot_execFaceActor_Params
{
	float                                              StrafingModifier;                                 		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKCarriedObject.GetTeamNum
// [0x00020500] 
struct AUDKCarriedObject_execGetTeamNum_Params
{
	uint8_t                                            ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKCarriedObject.OnBaseChainChanged
// [0x00020900] 
struct AUDKCarriedObject_eventOnBaseChainChanged_Params
{
};

// Function UDKBase.UDKCarriedObject.NotReachableBy
// [0x00020800] 
struct AUDKCarriedObject_eventNotReachableBy_Params
{
	class APawn*                                       P;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKCarriedObject.SetHUDLocation
// [0x00020500] 
struct AUDKCarriedObject_execSetHUDLocation_Params
{
	struct FVector                                     NewHUDLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKDataStore_GameSearchBase.HasExistingSearchResults
// [0x00020002] 
struct UUDKDataStore_GameSearchBase_execHasExistingSearchResults_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// uint32_t                                           bQueryCompleted : 1;                              		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function UDKBase.UDKDataStore_GameSearchBase.HasOutstandingQueries
// [0x00024002] 
struct UUDKDataStore_GameSearchBase_execHasOutstandingQueries_Params
{
	uint32_t                                           bRestrictCheckToSelf : 1;                         		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// uint32_t                                           bResult : 1;                                      		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// int32_t                                            I;                                                		// 0x000C (0x0004) [0x0000000000000000]               
};

// Function UDKBase.UDKDataStore_GameSearchBase.OnSearchComplete
// [0x00020002] 
struct UUDKDataStore_GameSearchBase_execOnSearchComplete_Params
{
	uint32_t                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function UDKBase.UDKDataStore_GameSearchBase.SubmitGameSearch
// [0x00024802] 
struct UUDKDataStore_GameSearchBase_eventSubmitGameSearch_Params
{
	uint8_t                                            ControllerIndex;                                  		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bInvalidateExistingSearchResults : 1;             		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// uint32_t                                           bResult : 1;                                      		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function UDKBase.UDKDataStore_GameSearchBase.Init
// [0x00020802] 
struct UUDKDataStore_GameSearchBase_eventInit_Params
{
};

// Function UDKBase.UDKEmitCameraEffect.UpdateLocation
// [0x00420400] 
struct AUDKEmitCameraEffect_execUpdateLocation_Params
{
	struct FVector                                     CamLoc;                                           		// 0x0000 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FRotator                                    CamRot;                                           		// 0x000C (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	float                                              CamFOVDeg;                                        		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKEmitCameraEffect.RegisterCamera
// [0x00020002] 
struct AUDKEmitCameraEffect_execRegisterCamera_Params
{
	class AUDKPlayerController*                        inCam;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKEmitCameraEffect.Destroyed
// [0x00020002] 
struct AUDKEmitCameraEffect_execDestroyed_Params
{
};

// Function UDKBase.UDKEmitCameraEffect.PostBeginPlay
// [0x00020902] 
struct AUDKEmitCameraEffect_eventPostBeginPlay_Params
{
};

// Function UDKBase.UDKEmitterPool.SpawnExplosionLight
// [0x00024002] 
struct AUDKEmitterPool_execSpawnExplosionLight_Params
{
	class UClass*                                      LightClass;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SpawnLocation;                                    		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      AttachToActor;                                    		// 0x0014 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UUDKExplosionLight*                          ReturnValue;                                      		// 0x001C (0x0008) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
	// class UUDKExplosionLight*                          Light;                                            		// 0x0024 (0x0008) [0x0000000004000000] (CPF_EditInline)
	// int32_t                                            I;                                                		// 0x002C (0x0004) [0x0000000000000000]               
};

// Function UDKBase.UDKEmitterPool.OnExplosionLightFinished
// [0x00020002] 
struct AUDKEmitterPool_execOnExplosionLightFinished_Params
{
	class UUDKExplosionLight*                          Light;                                            		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	// int32_t                                            I;                                                		// 0x0008 (0x0004) [0x0000000000000000]               
};

// Function UDKBase.UDKEmitterPool.SpawnEmitter
// [0x00024002] 
struct AUDKEmitterPool_execSpawnEmitter_Params
{
	class UParticleSystem*                             EmitterTemplate;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SpawnLocation;                                    		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    SpawnRotation;                                    		// 0x0014 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      AttachToActor;                                    		// 0x0020 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      InInstigator;                                     		// 0x0028 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            MaxDLEPooledReuses;                               		// 0x0030 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bInheritScaleFromBase : 1;                        		// 0x0034 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UParticleSystemComponent*                    ReturnValue;                                      		// 0x0038 (0x0008) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
	// class APlayerController*                           PC;                                               		// 0x0040 (0x0008) [0x0000000000000000]               
	// int32_t                                            LODLevel;                                         		// 0x0048 (0x0004) [0x0000000000000000]               
	// class UParticleSystemComponent*                    PSC;                                              		// 0x004C (0x0008) [0x0000000004000000] (CPF_EditInline)
};

// Function UDKBase.UDKExplosionLight.OnLightFinished
// [0x00120000] 
struct UUDKExplosionLight_execOnLightFinished_Params
{
	class UUDKExplosionLight*                          Light;                                            		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function UDKBase.UDKExplosionLight.ResetLight
// [0x00020401] 
struct UUDKExplosionLight_execResetLight_Params
{
};

// Function UDKBase.UDKForcedDirectionVolume.StopsProjectile
// [0x00020102] 
struct AUDKForcedDirectionVolume_execStopsProjectile_Params
{
	class AProjectile*                                 P;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKForcedDirectionVolume.UnTouch
// [0x00020902] 
struct AUDKForcedDirectionVolume_eventUnTouch_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// uint32_t                                           bInAnotherVolume : 1;                             		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AUDKForcedDirectionVolume*                   AnotherVolume;                                    		// 0x000C (0x0008) [0x0000000000000000]               
};

// Function UDKBase.UDKForcedDirectionVolume.Touch
// [0x00020902] 
struct AUDKForcedDirectionVolume_eventTouch_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitNormal;                                        		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
	// class AUDKVehicle*                                 V;                                                		// 0x0028 (0x0008) [0x0000000000000000]               
};

// Function UDKBase.UDKForcedDirectionVolume.ActorEnteredVolume
// [0x00020802] 
struct AUDKForcedDirectionVolume_eventActorEnteredVolume_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKForcedDirectionVolume.PostBeginPlay
// [0x00020102] 
struct AUDKForcedDirectionVolume_execPostBeginPlay_Params
{
};

// Function UDKBase.UDKGameInteraction.NotifyGameSessionEnded
// [0x00020002] 
struct UUDKGameInteraction_execNotifyGameSessionEnded_Params
{
};

// Function UDKBase.UDKGameInteraction.BlockUIInput
// [0x00020802] 
struct UUDKGameInteraction_eventBlockUIInput_Params
{
	uint32_t                                           bBlock : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function UDKBase.UDKGameInteraction.ClearUIInputBlocks
// [0x00020802] 
struct UUDKGameInteraction_eventClearUIInputBlocks_Params
{
};

// Function UDKBase.UDKGameInteraction.ShouldProcessUIInput
// [0x00020401] 
struct UUDKGameInteraction_execShouldProcessUIInput_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKGameObjective.GetTeamNum
// [0x00020500] 
struct AUDKGameObjective_execGetTeamNum_Params
{
	uint8_t                                            ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKGameObjective.DrawIcon
// [0x00020500] 
struct AUDKGameObjective_execDrawIcon_Params
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     IconLocation;                                     		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              IconWidth;                                        		// 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              IconAlpha;                                        		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AUDKPlayerController*                        PlayerOwner;                                      		// 0x001C (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                DrawColor;                                        		// 0x0024 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKGameObjective.SetHUDLocation
// [0x00020500] 
struct AUDKGameObjective_execSetHUDLocation_Params
{
	struct FVector                                     NewHUDLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKGameObjective.TriggerFlagEvent
// [0x00020000] 
struct AUDKGameObjective_execTriggerFlagEvent_Params
{
	struct FName                                       EventType;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 EventInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKGameObjective.BotNearObjective
// [0x00020000] 
struct AUDKGameObjective_execBotNearObjective_Params
{
	class AAIController*                               C;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKGameObjective.GetBestViewTarget
// [0x00020802] 
struct AUDKGameObjective_eventGetBestViewTarget_Params
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKGameObjective.ObjectiveChanged
// [0x00020000] 
struct AUDKGameObjective_execObjectiveChanged_Params
{
};

// Function UDKBase.UDKGameSettingsCommon.BlobToString
// [0x00422400] 
struct UUDKGameSettingsCommon_execBlobToString_Params
{
	class FString                                      InBlob;                                           		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function UDKBase.UDKGameSettingsCommon.StringToBlob
// [0x00422400] 
struct UUDKGameSettingsCommon_execStringToBlob_Params
{
	class FString                                      InString;                                         		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      OutBlob;                                          		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKGameViewportClient.LoadRandomLocalizedHintMessage
// [0x00020401] 
struct UUDKGameViewportClient_execLoadRandomLocalizedHintMessage_Params
{
	class FString                                      Category1Name;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      Category2Name;                                    		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function UDKBase.UDKHUD.TranslateBindToFont
// [0x00422400] 
struct AUDKHUD_execTranslateBindToFont_Params
{
	class FString                                      InBindStr;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UFont*                                       DrawFont;                                         		// 0x0010 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class FString                                      OutBindStr;                                       		// 0x0018 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function UDKBase.UDKHUD.DrawGlowText
// [0x00024400] 
struct AUDKHUD_execDrawGlowText_Params
{
	class FString                                      Text;                                             		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              X;                                                		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                		// 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              MaxHeightInPixels;                                		// 0x0018 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              PulseTime;                                        		// 0x001C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bRightJustified : 1;                              		// 0x0020 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function UDKBase.UDKJumpPad.SuggestMovePreparation
// [0x00020802] 
struct AUDKJumpPad_eventSuggestMovePreparation_Params
{
	class APawn*                                       Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class AVehicle*                                    V;                                                		// 0x000C (0x0008) [0x0000000000000000]               
};

// Function UDKBase.UDKJumpPad.PostTouch
// [0x00020802] 
struct AUDKJumpPad_eventPostTouch_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AUDKPawn*                                    P;                                                		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function UDKBase.UDKJumpPad.Touch
// [0x00020802] 
struct AUDKJumpPad_eventTouch_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitNormal;                                        		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKKActorBreakable.ReplicatedEvent
// [0x00020902] 
struct AUDKKActorBreakable_eventReplicatedEvent_Params
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKKActorBreakable.BreakApart
// [0x00020002] 
struct AUDKKActorBreakable_execBreakApart_Params
{
};

// Function UDKBase.UDKKActorBreakable.EncroachingOn
// [0x00020002] 
struct AUDKKActorBreakable_execEncroachingOn_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKKActorBreakable.TakeDamage
// [0x00024802] 
struct AUDKKActorBreakable_eventTakeDamage_Params
{
	int32_t                                            Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 EventInstigator;                                  		// 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UClass*                                      DamageType;                                       		// 0x0024 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          		// 0x002C (0x0028) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     		// 0x0054 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function UDKBase.UDKKActorBreakable.OnEncroach
// [0x00120000] 
struct AUDKKActorBreakable_execOnEncroach_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKKActorBreakable.OnBreakApart
// [0x00120000] 
struct AUDKKActorBreakable_execOnBreakApart_Params
{
};

// Function UDKBase.UDKParticleSystemComponent.SetFOV
// [0x00020401] 
struct UUDKParticleSystemComponent_execSetFOV_Params
{
	float                                              NewFOV;                                           		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPawn.StuckFalling
// [0x00020800] 
struct AUDKPawn_eventStuckFalling_Params
{
};

// Function UDKBase.UDKPawn.UpdateEyeHeight
// [0x00020800] 
struct AUDKPawn_eventUpdateEyeHeight_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPawn.TakeHitBlendedOut
// [0x00020900] 
struct AUDKPawn_eventTakeHitBlendedOut_Params
{
};

// Function UDKBase.UDKPawn.StartFeignDeathRecoveryAnim
// [0x00020900] 
struct AUDKPawn_eventStartFeignDeathRecoveryAnim_Params
{
};

// Function UDKBase.UDKPawn.SetHandIKEnabled
// [0x00020100] 
struct AUDKPawn_execSetHandIKEnabled_Params
{
	uint32_t                                           bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function UDKBase.UDKPawn.SetWeaponAttachmentVisibility
// [0x00020100] 
struct AUDKPawn_execSetWeaponAttachmentVisibility_Params
{
	uint32_t                                           bAttachmentVisible : 1;                           		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function UDKBase.UDKPawn.NativePostRenderFor
// [0x00020500] 
struct AUDKPawn_execNativePostRenderFor_Params
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPawn.SetHUDLocation
// [0x00020500] 
struct AUDKPawn_execSetHUDLocation_Params
{
	struct FVector                                     NewHUDLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPawn.SuggestJumpVelocity
// [0x00424400] 
struct AUDKPawn_execSuggestJumpVelocity_Params
{
	struct FVector                                     JumpVelocity;                                     		// 0x0000 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Destination;                                      		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Start;                                            		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bRequireFallLanding : 1;                          		// 0x0024 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKPawn.StartCrouch
// [0x00020902] 
struct AUDKPawn_eventStartCrouch_Params
{
	float                                              HeightAdjust;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPawn.EndCrouch
// [0x00020902] 
struct AUDKPawn_eventEndCrouch_Params
{
	float                                              HeightAdjust;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPawn.StoppedFalling
// [0x00020802] 
struct AUDKPawn_eventStoppedFalling_Params
{
};

// Function UDKBase.UDKPawn.HoldGameObject
// [0x00020900] 
struct AUDKPawn_eventHoldGameObject_Params
{
	class AUDKCarriedObject*                           UDKGameObj;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPawn.IsInvisible
// [0x00020400] 
struct AUDKPawn_execIsInvisible_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKPawn.GetTargetLocation
// [0x00024500] 
struct AUDKPawn_execGetTargetLocation_Params
{
	class AActor*                                      RequestedBy;                                      		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bRequestAlternateLoc : 1;                         		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKPawn.EnsureOverlayComponentLast
// [0x00020400] 
struct AUDKPawn_execEnsureOverlayComponentLast_Params
{
};

// Function UDKBase.UDKPawn.RestorePreRagdollCollisionComponent
// [0x00020400] 
struct AUDKPawn_execRestorePreRagdollCollisionComponent_Params
{
};

// Function UDKBase.UDKPawn.GetBoundingCylinder
// [0x00420400] 
struct AUDKPawn_execGetBoundingCylinder_Params
{
	float                                              CollisionRadius;                                  		// 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              CollisionHeight;                                  		// 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function UDKBase.UDKPickupFactory.SetPickupHidden
// [0x00020102] 
struct AUDKPickupFactory_execSetPickupHidden_Params
{
};

// Function UDKBase.UDKPickupFactory.SetPickupVisible
// [0x00020102] 
struct AUDKPickupFactory_execSetPickupVisible_Params
{
};

// Function UDKBase.UDKPlayerController.GetTargetAdhesionFrictionTarget
// [0x00420400] 
struct AUDKPlayerController_execGetTargetAdhesionFrictionTarget_Params
{
	float                                              MaxDistance;                                      		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CamLoc;                                           		// 0x0004 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FRotator                                    CamRot;                                           		// 0x0010 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       ReturnValue;                                      		// 0x001C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKPlayerController.ClearCameraEffect
// [0x00020002] 
struct AUDKPlayerController_execClearCameraEffect_Params
{
};

// Function UDKBase.UDKPlayerController.ClientSpawnCameraEffect
// [0xFFFF000001820142] 
struct AUDKPlayerController_execClientSpawnCameraEffect_Params
{
	class UClass*                                      CameraEffectClass;                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// struct FVector                                     CamLoc;                                           		// 0x0008 (0x000C) [0x0000000000000000]               
	// struct FRotator                                    CamRot;                                           		// 0x0014 (0x000C) [0x0000000000000000]               
};

// Function UDKBase.UDKPlayerController.RemoveCameraEffect
// [0x00020002] 
struct AUDKPlayerController_execRemoveCameraEffect_Params
{
	class AUDKEmitCameraEffect*                        CamEmitter;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPlayerController.IsMouseAvailable
// [0x00020500] 
struct AUDKPlayerController_execIsMouseAvailable_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKPlayerController.IsKeyboardAvailable
// [0x00020500] 
struct AUDKPlayerController_execIsKeyboardAvailable_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKPlayerController.SetHardwarePhysicsEnabled
// [0x00020400] 
struct AUDKPlayerController_execSetHardwarePhysicsEnabled_Params
{
	uint32_t                                           bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function UDKBase.UDKPlayerController.SetGamma
// [0x00020400] 
struct AUDKPlayerController_execSetGamma_Params
{
	float                                              GammaValue;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKPlayerInput.GetUDKBindNameFromCommand
// [0x00020400] 
struct UUDKPlayerInput_execGetUDKBindNameFromCommand_Params
{
	class FString                                      BindCommand;                                      		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function UDKBase.UDKProfileSettings.ResetKeysToDefault
// [0x00026400] 
struct UUDKProfileSettings_execResetKeysToDefault_Params
{
	class ULocalPlayer*                                InPlayerOwner;                                    		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function UDKBase.UDKProfileSettings.ResetToDefault
// [0x00020400] 
struct UUDKProfileSettings_execResetToDefault_Params
{
	int32_t                                            ProfileId;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKProjectile.CreateProjectileLight
// [0x00020900] 
struct AUDKProjectile_eventCreateProjectileLight_Params
{
};

// Function UDKBase.UDKProjectile.GetTerminalVelocity
// [0x00020400] 
struct AUDKProjectile_execGetTerminalVelocity_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKScout.SuggestJumpVelocity
// [0x00424400] 
struct AUDKScout_execSuggestJumpVelocity_Params
{
	struct FVector                                     JumpVelocity;                                     		// 0x0000 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Destination;                                      		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Start;                                            		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bRequireFallLanding : 1;                          		// 0x0024 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKScriptedNavigationPoint.NotifyAnchorFindingResult
// [0x00020800] 
struct AUDKScriptedNavigationPoint_eventNotifyAnchorFindingResult_Params
{
	class ANavigationPoint*                            EndAnchor;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class APawn*                                       RouteFinder;                                      		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKScriptedNavigationPoint.SpecifyEndAnchor
// [0x00020800] 
struct AUDKScriptedNavigationPoint_eventSpecifyEndAnchor_Params
{
	class APawn*                                       RouteFinder;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class ANavigationPoint*                            ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKSkeletalMeshComponent.SetFOV
// [0x00020401] 
struct UUDKSkeletalMeshComponent_execSetFOV_Params
{
	float                                              NewFOV;                                           		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKSkeletalMeshComponent.PreloadTextures
// [0x00020902] 
struct UUDKSkeletalMeshComponent_eventPreloadTextures_Params
{
	uint32_t                                           bForcePreload : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              ClearTime;                                        		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                            Idx;                                              		// 0x0008 (0x0004) [0x0000000000000000]               
};

// Function UDKBase.UDKTeamOwnedInfo.GetTeamNum
// [0x00020500] 
struct AUDKTeamOwnedInfo_execGetTeamNum_Params
{
	uint8_t                                            ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKTeleporterBase.Accept
// [0x00020902] 
struct AUDKTeleporterBase_eventAccept_Params
{
	class AActor*                                      Incoming;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Source;                                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKTeleporterBase.InitializePortalEffect
// [0x00020102] 
struct AUDKTeleporterBase_execInitializePortalEffect_Params
{
	class AActor*                                      Dest;                                             		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// uint32_t                                           bStaticCapture : 1;                               		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function UDKBase.UDKTeleporterBase.PostBeginPlay
// [0x00020902] 
struct AUDKTeleporterBase_eventPostBeginPlay_Params
{
	// class ATeleporter*                                 Dest;                                             		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function UDKBase.UDKUIDataProvider_SearchResult.IsPrivateServer
// [0x00020400] 
struct UUDKUIDataProvider_SearchResult_execIsPrivateServer_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKUIDataStore_MenuItems.AddListElementProvidersKey
// [0x00020400] 
struct UUDKUIDataStore_MenuItems_execAddListElementProvidersKey_Params
{
	struct FName                                       KeyName;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UUDKUIResourceDataProvider*                  Provider;                                         		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKUIDataStore_MenuItems.RemoveListElementProvidersKey
// [0x00020400] 
struct UUDKUIDataStore_MenuItems_execRemoveListElementProvidersKey_Params
{
	struct FName                                       KeyName;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKUIDataStore_MenuItems.InitializeListElementProviders
// [0x00020802] 
struct UUDKUIDataStore_MenuItems_eventInitializeListElementProviders_Params
{
	// TArray<class UUDKUIResourceDataProvider*>          WeaponProviders;                                  		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class UUDKUIResourceDataProvider*                  Provider;                                         		// 0x0010 (0x0008) [0x0000000000000000]               
	// int32_t                                            WeaponIdx;                                        		// 0x0018 (0x0004) [0x0000000000000000]               
};

// Function UDKBase.UDKUIDataStore_MenuItems.GetProviderSet
// [0x00420400] 
struct UUDKUIDataStore_MenuItems_execGetProviderSet_Params
{
	struct FName                                       ProviderFieldName;                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	TArray<class UUDKUIResourceDataProvider*>          OutProviders;                                     		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKUIDataStore_MenuItems.GetAllResourceDataProviders
// [0x00422401] 
struct UUDKUIDataStore_MenuItems_execGetAllResourceDataProviders_Params
{
	class UClass*                                      ProviderClass;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	TArray<class UUDKUIResourceDataProvider*>          Providers;                                        		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function UDKBase.UDKUIDataStore_StringAliasBindingMap.ClearBoundKeyCache
// [0x00020401] 
struct UUDKUIDataStore_StringAliasBindingMap_execClearBoundKeyCache_Params
{
};

// Function UDKBase.UDKUIDataStore_StringAliasBindingMap.AddMappingToBoundKeyCache
// [0x00080401] 
struct UUDKUIDataStore_StringAliasBindingMap_execAddMappingToBoundKeyCache_Params
{
	class FString                                      Command;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      MappingStr;                                       		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            FieldIndex;                                       		// 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function UDKBase.UDKUIDataStore_StringAliasBindingMap.FindMappingInBoundKeyCache
// [0x00480401] 
struct UUDKUIDataStore_StringAliasBindingMap_execFindMappingInBoundKeyCache_Params
{
	class FString                                      Command;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      MappingStr;                                       		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            FieldIndex;                                       		// 0x0020 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function UDKBase.UDKUIDataStore_StringAliasBindingMap.GetBoundStringWithFieldName
// [0x00424400] 
struct UUDKUIDataStore_StringAliasBindingMap_execGetBoundStringWithFieldName_Params
{
	class FString                                      FieldName;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      MappedString;                                     		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            StartIndex;                                       		// 0x0020 (0x0004) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
